Antonecu/fw-custom-example/generated/controllers/generated/rusefi_generated_mega_stm32f4xx.h
//
// CHeaderConsumer was generated automatically by rusEFI tool config_definition-all.jar based on gen_config.sh integration/rusefi_config.txt
//

#define accel_enrichment_mode_e_AE_MODE_MS_ADDER 0
#define accel_enrichment_mode_e_AE_MODE_PERCENT_ADDER 1
#define accel_enrichment_mode_e_AE_MODE_PREDICTIVE_MAP 2
#define accel_enrichment_mode_e_auto_enum 0="AE_MODE_MS_ADDER",1="AE_MODE_PERCENT_ADDER",2="AE_MODE_PREDICTIVE_MAP"
#define adc_channel_e_auto_enum 0="EFI_ADC_NONE",1="EFI_ADC_0",2="EFI_ADC_1",11="EFI_ADC_10",12="EFI_ADC_11",13="EFI_ADC_12",14="EFI_ADC_13",15="EFI_ADC_14",16="EFI_ADC_15",17="EFI_ADC_16",18="EFI_ADC_17",19="EFI_ADC_18",20="EFI_ADC_19",3="EFI_ADC_2",21="EFI_ADC_20",22="EFI_ADC_21",23="EFI_ADC_22",24="EFI_ADC_23",25="EFI_ADC_24",26="EFI_ADC_25",27="EFI_ADC_26",28="EFI_ADC_27",29="EFI_ADC_28",30="EFI_ADC_29",4="EFI_ADC_3",31="EFI_ADC_30",32="EFI_ADC_31",33="EFI_ADC_32",34="EFI_ADC_33",35="EFI_ADC_34",36="EFI_ADC_35",37="EFI_ADC_36",38="EFI_ADC_37",39="EFI_ADC_38",40="EFI_ADC_39",5="EFI_ADC_4",41="EFI_ADC_40",42="EFI_ADC_41",43="EFI_ADC_42",44="EFI_ADC_43",45="EFI_ADC_44",46="EFI_ADC_45",47="EFI_ADC_46",48="EFI_ADC_47",6="EFI_ADC_5",7="EFI_ADC_6",8="EFI_ADC_7",9="EFI_ADC_8",10="EFI_ADC_9",50="EFI_ADC_ERROR",49="EFI_ADC_TOTAL_CHANNELS"
#define adc_channel_e_EFI_ADC_0 1
#define adc_channel_e_EFI_ADC_1 2
#define adc_channel_e_EFI_ADC_10 11
#define adc_channel_e_EFI_ADC_11 12
#define adc_channel_e_EFI_ADC_12 13
#define adc_channel_e_EFI_ADC_13 14
#define adc_channel_e_EFI_ADC_14 15
#define adc_channel_e_EFI_ADC_15 16
#define adc_channel_e_EFI_ADC_16 17
#define adc_channel_e_EFI_ADC_17 18
#define adc_channel_e_EFI_ADC_18 19
#define adc_channel_e_EFI_ADC_19 20
#define adc_channel_e_EFI_ADC_2 3
#define adc_channel_e_EFI_ADC_20 21
#define adc_channel_e_EFI_ADC_21 22
#define adc_channel_e_EFI_ADC_22 23
#define adc_channel_e_EFI_ADC_23 24
#define adc_channel_e_EFI_ADC_24 25
#define adc_channel_e_EFI_ADC_25 26
#define adc_channel_e_EFI_ADC_26 27
#define adc_channel_e_EFI_ADC_27 28
#define adc_channel_e_EFI_ADC_28 29
#define adc_channel_e_EFI_ADC_29 30
#define adc_channel_e_EFI_ADC_3 4
#define adc_channel_e_EFI_ADC_30 31
#define adc_channel_e_EFI_ADC_31 32
#define adc_channel_e_EFI_ADC_32 33
#define adc_channel_e_EFI_ADC_33 34
#define adc_channel_e_EFI_ADC_34 35
#define adc_channel_e_EFI_ADC_35 36
#define adc_channel_e_EFI_ADC_36 37
#define adc_channel_e_EFI_ADC_37 38
#define adc_channel_e_EFI_ADC_38 39
#define adc_channel_e_EFI_ADC_39 40
#define adc_channel_e_EFI_ADC_4 5
#define adc_channel_e_EFI_ADC_40 41
#define adc_channel_e_EFI_ADC_41 42
#define adc_channel_e_EFI_ADC_42 43
#define adc_channel_e_EFI_ADC_43 44
#define adc_channel_e_EFI_ADC_44 45
#define adc_channel_e_EFI_ADC_45 46
#define adc_channel_e_EFI_ADC_46 47
#define adc_channel_e_EFI_ADC_47 48
#define adc_channel_e_EFI_ADC_5 6
#define adc_channel_e_EFI_ADC_6 7
#define adc_channel_e_EFI_ADC_7 8
#define adc_channel_e_EFI_ADC_8 9
#define adc_channel_e_EFI_ADC_9 10
#define adc_channel_e_EFI_ADC_ERROR 50
#define adc_channel_e_EFI_ADC_NONE 0
#define adc_channel_e_EFI_ADC_TOTAL_CHANNELS 49
#define adc_channel_e_enum 0="NONE",7="A10 (PA6)",8="A11 (PA7)",15="A12 (PC4)",16="A13 (PC5)",9="A14 (PB0)",6="A9 (PA5)",14="BARO (PC3)",12="CLT (PC1)",11="IAT (PC0)",4="KNOCK (PA3)",3="MAF (PA2)",10="MAF2 (PB1)",2="MAP (PA1)",5="O2 (PA4)",13="TPS (PC2)",1="VBAT (PA0)"
#define adc_channel_e_fullenum "NONE","VBAT (PA0)","MAP (PA1)","MAF (PA2)","KNOCK (PA3)","O2 (PA4)","A9 (PA5)","A10 (PA6)","A11 (PA7)","A14 (PB0)","MAF2 (PB1)","IAT (PC0)","CLT (PC1)","TPS (PC2)","BARO (PC3)","A12 (PC4)","A13 (PC5)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID"
#define ADC_CHANNEL_NONE 0
#define afr_sensor_s_size 20
#define air_pressure_sensor_config_s_size 12
#define air_pressure_sensor_type_e_auto_enum 0="MT_CUSTOM",10="MT_BOSCH_2_5",16="MT_BOSCH_3_BAR",1="MT_DENSO183",4="MT_DODGE_NEON_2003",13="MT_GM_1_BAR",12="MT_GM_2_BAR",6="MT_GM_3_BAR",3="MT_HONDA3BAR",11="MT_MAZDA_1_BAR",7="MT_MPX4100",2="MT_MPX4250",9="MT_MPX4250A",15="MT_MPXH6300",14="MT_MPXH6400",5="MT_SUBY_DENSO",8="MT_TOYOTA_89420_02010"
#define air_pressure_sensor_type_e_MT_BOSCH_2_5 10
#define air_pressure_sensor_type_e_MT_BOSCH_3_BAR 16
#define air_pressure_sensor_type_e_MT_CUSTOM 0
#define air_pressure_sensor_type_e_MT_DENSO183 1
#define air_pressure_sensor_type_e_MT_DODGE_NEON_2003 4
#define air_pressure_sensor_type_e_MT_GM_1_BAR 13
#define air_pressure_sensor_type_e_MT_GM_2_BAR 12
#define air_pressure_sensor_type_e_MT_GM_3_BAR 6
#define air_pressure_sensor_type_e_MT_HONDA3BAR 3
#define air_pressure_sensor_type_e_MT_MAZDA_1_BAR 11
#define air_pressure_sensor_type_e_MT_MPX4100 7
#define air_pressure_sensor_type_e_MT_MPX4250 2
#define air_pressure_sensor_type_e_MT_MPX4250A 9
#define air_pressure_sensor_type_e_MT_MPXH6300 15
#define air_pressure_sensor_type_e_MT_MPXH6400 14
#define air_pressure_sensor_type_e_MT_SUBY_DENSO 5
#define air_pressure_sensor_type_e_MT_TOYOTA_89420_02010 8
#define ALS_RPM_SIZE 4
#define ALS_SIZE 4
#define ALTERNATOR_VOLTAGE_RPM_SIZE 4
#define ALTERNATOR_VOLTAGE_TARGET_SIZE 4
#define antiLagActivationMode_e_ALWAYS_ON_ANTILAG 1
#define antiLagActivationMode_e_auto_enum 0="SWITCH_INPUT_ANTILAG",1="ALWAYS_ON_ANTILAG",2="LUA_ANTILAG"
#define antiLagActivationMode_e_enum "Switch Input", "Always Active", "Lua"
#define antiLagActivationMode_e_LUA_ANTILAG 2
#define antiLagActivationMode_e_SWITCH_INPUT_ANTILAG 0
#define AUX_DIGITAL_VALVE_COUNT 2
#define AUX_SPEED_SENSOR_COUNT 2
#define BANKS_COUNT 2
#define BARO_CORR_SIZE 4
#define BENCH_AC_RELAY_DURATION 800
#define BENCH_FAN_DURATION 2000
#define BENCH_FUEL_PUMP_DURATION 3000
#define BENCH_MAIN_RELAY_DURATION 1000
#define bench_mode_e_BENCH_AC_COMPRESSOR_RELAY 6
#define bench_mode_e_BENCH_AUXOUT0 20
#define bench_mode_e_BENCH_AUXOUT1 21
#define bench_mode_e_BENCH_AUXOUT2 22
#define bench_mode_e_BENCH_AUXOUT3 23
#define bench_mode_e_BENCH_AUXOUT4 24
#define bench_mode_e_BENCH_AUXOUT5 25
#define bench_mode_e_BENCH_AUXOUT6 26
#define bench_mode_e_BENCH_AUXOUT7 27
#define bench_mode_e_BENCH_BOOST_VALVE 43
#define bench_mode_e_BENCH_CANCEL 15
#define bench_mode_e_BENCH_CHECK_ENGINE_LIGHT 7
#define bench_mode_e_BENCH_FAN_RELAY 4
#define bench_mode_e_BENCH_FAN_RELAY_2 5
#define bench_mode_e_BENCH_FUEL_PUMP 1
#define bench_mode_e_BENCH_GPPWM1_VALVE 10
#define bench_mode_e_BENCH_GPPWM2_VALVE 11
#define bench_mode_e_BENCH_GPPWM3_VALVE 12
#define bench_mode_e_BENCH_GPPWM4_VALVE 13
#define bench_mode_e_BENCH_HPFP_VALVE 9
#define bench_mode_e_BENCH_IDLE_VALVE 8
#define bench_mode_e_BENCH_MAIN_RELAY 0
#define bench_mode_e_BENCH_SECOND_IDLE_VALVE 14
#define bench_mode_e_BENCH_STARTER_DISABLE_RELAY 3
#define bench_mode_e_BENCH_STARTER_ENABLE_RELAY 2
#define bench_mode_e_BENCH_VVT0_VALVE 16
#define bench_mode_e_BENCH_VVT1_VALVE 17
#define bench_mode_e_BENCH_VVT2_VALVE 18
#define bench_mode_e_BENCH_VVT3_VALVE 19
#define bench_mode_e_HD_ACR 28
#define bench_mode_e_HD_ACR2 29
#define bench_mode_e_LTFT_APPLY_TO_VE 31
#define bench_mode_e_LTFT_DEV_POKE 32
#define bench_mode_e_LTFT_RESET 30
#define bench_mode_e_LUA_COMMAND_1 33
#define bench_mode_e_LUA_COMMAND_10 42
#define bench_mode_e_LUA_COMMAND_2 34
#define bench_mode_e_LUA_COMMAND_3 35
#define bench_mode_e_LUA_COMMAND_4 36
#define bench_mode_e_LUA_COMMAND_5 37
#define bench_mode_e_LUA_COMMAND_6 38
#define bench_mode_e_LUA_COMMAND_7 39
#define bench_mode_e_LUA_COMMAND_8 40
#define bench_mode_e_LUA_COMMAND_9 41
#define BENCH_STARTER_DURATION 4000
#define BENCH_VVT_DURATION 300
#define BLEND_FACTOR_SIZE 8
#define BLEND_PRECISION 0.1
#define BLEND_TABLE_COUNT 8
#define blend_table_s_BLEND_PRECISION_size 188
#define blend_table_s_size 188
#define blend_table_s_TARGET_AFR_BLEND_PRECISION_size 188
#define BLOCKING_FACTOR 1024
#define BOARD_ACTION_INJECTOR_PRESET 0x302
#define BOARD_CAM_SETTINGS_FILE
#define BOARD_CAN_BUS_FROM_FILE
#define BOARD_CONSTANTS_EXTENSIONS_FROM_FILE
#define BOARD_CONTROLLER_MENU_PREFIX_FROM_FILE
#define BOARD_CONTROLLER_MENU_SUFFIX_FROM_FILE
#define BOARD_CURVES_FROM_FILE
#define BOARD_DIAG_PANEL1_FROM_FILE
#define BOARD_DIAG_PANEL2_FROM_FILE
#define BOARD_ENGINE_CONFIGURATION_FROM_FILE
#define BOARD_ENGINE_METADATA_FILE
#define BOARD_FRONT_PAGE_FROM_FILE
#define BOARD_GAUGES_FROM_FILE
#define BOARD_IGNITION_ADVANCE_MENU_FROM_FILE
#define BOARD_IGNITION_SETTINGS_FROM_FILE
#define BOARD_INJECTION_SETTINGS_FROM_FILE
#define BOARD_INJECTOR_SETTINGS_FROM_FILE
#define BOARD_MENU_FROM_FILE
#define BOARD_OPTIONS_FROM_FILE
#define BOARD_PANELS_FROM_FILE
#define BOARD_PC_VARIABLES_FROM_FILE
#define BOARD_POPULAR_VEHICLES_FILE
#define BOARD_PRIMING_PULSE_PANEL_FROM_FILE
#define BOARD_TABLES_FROM_FILE
#define BOARD_VE_FROM_FILE
#define BOARD_VE_MENU_FROM_FILE
#define BOARD_VIN_FIELD_FROM_FILE
#define BOOST_BLEND_COUNT 2
#define BOOST_CURVE_SIZE 5
#define BOOST_LOAD_COUNT 8
#define BOOST_RPM_COUNT 8
#define boostType_e_auto_enum 0="OPEN_LOOP",1="CLOSED_LOOP"
#define boostType_e_CLOSED_LOOP 1
#define boostType_e_OPEN_LOOP 0
#define brain_input_pin_e_enum 0="NONE",68="ACPRESS (PE2)",70="ACSW (PE4)",27="CAM (PB9)",25="CAM2 (PB7)",26="CKP (PB8)",23="CLUTCH (PB5)",61="D12 (PD11)",60="D13 (PD10)",33="D23 (SPI2 MOSI B15)",32="D25 (SPI2 MISO B14)",30="D27 (SPI2 CS B12)",31="D29 (SPI2 SCK B13)",17="FLEX (PA15)",81="IN22L (PE15)",53="IN42H (D3)",67="PSP (PE1)",56="RX3 (PD6)",55="TX3 (PD5)",24="VSS (PB6)"
#define brain_input_pin_e_fullenum "NONE","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","FLEX (PA15)","INVALID","INVALID","INVALID","INVALID","INVALID","CLUTCH (PB5)","VSS (PB6)","CAM2 (PB7)","CKP (PB8)","CAM (PB9)","INVALID","INVALID","D27 (SPI2 CS B12)","D29 (SPI2 SCK B13)","D25 (SPI2 MISO B14)","D23 (SPI2 MOSI B15)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","IN42H (D3)","INVALID","TX3 (PD5)","RX3 (PD6)","INVALID","INVALID","INVALID","D13 (PD10)","D12 (PD11)","INVALID","INVALID","INVALID","INVALID","INVALID","PSP (PE1)","ACPRESS (PE2)","INVALID","ACSW (PE4)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","IN22L (PE15)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID"
#define brain_pin_diag_e_PIN_DRIVER_OFF 0x20
#define brain_pin_diag_e_PIN_DRIVER_OVERTEMP 0x10
#define brain_pin_diag_e_PIN_OK 0
#define brain_pin_diag_e_PIN_OPEN 0x01
#define brain_pin_diag_e_PIN_OVERLOAD 0x08
#define brain_pin_diag_e_PIN_SHORT_TO_BAT 0x04
#define brain_pin_diag_e_PIN_SHORT_TO_GND 0x02
#define brain_pin_diag_e_PIN_UNKNOWN 0x80
#define C_MC33810_COUNT 1
#define CAM_1_MODE_NAME "Cam mode (intake)"
#define CAM_2_MODE_NAME "Cam mode (exhaust)"
#define CAM_INPUT_1_1_NAME "Cam sensor bank 1 intake"
#define CAM_INPUTS_COUNT 4
#define CAMS_PER_BANK 2
#define can_baudrate_e_auto_enum 0="B33KBPS",3="B100KBPS",4="B125KBPS",8="B1MBPS",5="B250KBPS",6="B500KBPS",1="B50KBPS",7="B666KBPS",2="B83KBPS"
#define can_baudrate_e_B100KBPS 3
#define can_baudrate_e_B125KBPS 4
#define can_baudrate_e_B1MBPS 8
#define can_baudrate_e_B250KBPS 5
#define can_baudrate_e_B33KBPS 0
#define can_baudrate_e_B500KBPS 6
#define can_baudrate_e_B50KBPS 1
#define can_baudrate_e_B666KBPS 7
#define can_baudrate_e_B83KBPS 2
#define can_baudrate_e_enum "33.33kbps", "50kbps", "83.33kbps", "100kbps", "125kbps", "250kbps", "500kbps", "666kbps", "1Mbps"
#define CAN_BENCH_HEADER2 0x66
#define can_broadcast_channel_e_auto_enum 0="CAN_BUS_FIRST",1="CAN_BUS_SECOND",2="CAN_BUS_THIRD"
#define can_broadcast_channel_e_CAN_BUS_FIRST 0
#define can_broadcast_channel_e_CAN_BUS_SECOND 1
#define can_broadcast_channel_e_CAN_BUS_THIRD 2
#define can_broadcast_channel_e_enum "Primary CAN", "Secondary CAN", "Third CAN"
#define can_bus_channel_e_auto_enum 0="CAN_BUS_NONE",1="CAN_BUS_CAN1",2="CAN_BUS_CAN2",3="CAN_BUS_CAN3"
#define can_bus_channel_e_CAN_BUS_CAN1 1
#define can_bus_channel_e_CAN_BUS_CAN2 2
#define can_bus_channel_e_CAN_BUS_CAN3 3
#define can_bus_channel_e_CAN_BUS_NONE 0
#define can_bus_channel_e_enum "None", "Primary CAN", "Secondary CAN", "Third CAN"
#define CAN_DEFAULT_BASE 0x200
#define CAN_ECU_SERIAL_RX_ID 0x710
#define CAN_ECU_SERIAL_TX_ID 0x720
#define can_nbc_e_auto_enum 0="CAN_BUS_NBC_NONE",12="CAN_AIM_DASH",4="CAN_BUS_BMW_E46",6="CAN_BUS_BMW_E90",10="CAN_BUS_GENESIS_COUPE",11="CAN_BUS_HONDA_K",7="CAN_BUS_Haltech",3="CAN_BUS_MAZDA_RX8",8="CAN_BUS_MQB",13="CAN_BUS_MS_SIMPLE_BROADCAST",1="CAN_BUS_NBC_FIAT",2="CAN_BUS_NBC_VAG",9="CAN_BUS_NISSAN_VQ",5="CAN_BUS_W202_C180"
#define can_nbc_e_CAN_AIM_DASH 12
#define can_nbc_e_CAN_BUS_BMW_E46 4
#define can_nbc_e_CAN_BUS_BMW_E90 6
#define can_nbc_e_CAN_BUS_GENESIS_COUPE 10
#define can_nbc_e_CAN_BUS_Haltech 7
#define can_nbc_e_CAN_BUS_HONDA_K 11
#define can_nbc_e_CAN_BUS_MAZDA_RX8 3
#define can_nbc_e_CAN_BUS_MQB 8
#define can_nbc_e_CAN_BUS_MS_SIMPLE_BROADCAST 13
#define can_nbc_e_CAN_BUS_NBC_FIAT 1
#define can_nbc_e_CAN_BUS_NBC_NONE 0
#define can_nbc_e_CAN_BUS_NBC_VAG 2
#define can_nbc_e_CAN_BUS_NISSAN_VQ 9
#define can_nbc_e_CAN_BUS_W202_C180 5
#define CAN_RX_PREFIX "CAN_rx"
#define can_sniffer_channel_s_size 4
#define can_vss_nbc_e_auto_enum 0="BMW_e46",2="BMW_e90",5="HONDA_CIVIC9",4="HYUNDAI_PB",3="NISSAN_350",1="W202"
#define can_vss_nbc_e_BMW_e46 0
#define can_vss_nbc_e_BMW_e90 2
#define can_vss_nbc_e_HONDA_CIVIC9 5
#define can_vss_nbc_e_HYUNDAI_PB 4
#define can_vss_nbc_e_NISSAN_350 3
#define can_vss_nbc_e_W202 1
#define can_wbo_aem_id_e_auto_enum 0="WBO_AEM_ID1",9="WBO_AEM_ID10",10="WBO_AEM_ID11",11="WBO_AEM_ID12",12="WBO_AEM_ID13",13="WBO_AEM_ID14",14="WBO_AEM_ID15",15="WBO_AEM_ID16",1="WBO_AEM_ID2",2="WBO_AEM_ID3",3="WBO_AEM_ID4",4="WBO_AEM_ID5",5="WBO_AEM_ID6",6="WBO_AEM_ID7",7="WBO_AEM_ID8",8="WBO_AEM_ID9"
#define can_wbo_aem_id_e_WBO_AEM_ID1 0
#define can_wbo_aem_id_e_WBO_AEM_ID10 9
#define can_wbo_aem_id_e_WBO_AEM_ID11 10
#define can_wbo_aem_id_e_WBO_AEM_ID12 11
#define can_wbo_aem_id_e_WBO_AEM_ID13 12
#define can_wbo_aem_id_e_WBO_AEM_ID14 13
#define can_wbo_aem_id_e_WBO_AEM_ID15 14
#define can_wbo_aem_id_e_WBO_AEM_ID16 15
#define can_wbo_aem_id_e_WBO_AEM_ID2 1
#define can_wbo_aem_id_e_WBO_AEM_ID3 2
#define can_wbo_aem_id_e_WBO_AEM_ID4 3
#define can_wbo_aem_id_e_WBO_AEM_ID5 4
#define can_wbo_aem_id_e_WBO_AEM_ID6 5
#define can_wbo_aem_id_e_WBO_AEM_ID7 6
#define can_wbo_aem_id_e_WBO_AEM_ID8 7
#define can_wbo_aem_id_e_WBO_AEM_ID9 8
#define CAN_WBO_COUNT 2
#define can_wbo_re_hwidx_e_auto_enum 0="WBO_RE_HWIDX0",1="WBO_RE_HWIDX1",2="WBO_RE_HWIDX2",3="WBO_RE_HWIDX3",4="WBO_RE_HWIDX4",5="WBO_RE_HWIDX5",6="WBO_RE_HWIDX6",7="WBO_RE_HWIDX7"
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX0 0
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX1 1
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX2 2
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX3 3
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX4 4
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX5 5
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX6 6
#define can_wbo_re_hwidx_e_WBO_RE_HWIDX7 7
#define can_wbo_re_id_e_auto_enum 0="WBO_RE_ID1",9="WBO_RE_ID10",10="WBO_RE_ID11",11="WBO_RE_ID12",12="WBO_RE_ID13",13="WBO_RE_ID14",14="WBO_RE_ID15",15="WBO_RE_ID16",1="WBO_RE_ID2",2="WBO_RE_ID3",3="WBO_RE_ID4",4="WBO_RE_ID5",5="WBO_RE_ID6",6="WBO_RE_ID7",7="WBO_RE_ID8",8="WBO_RE_ID9"
#define can_wbo_re_id_e_WBO_RE_ID1 0
#define can_wbo_re_id_e_WBO_RE_ID10 9
#define can_wbo_re_id_e_WBO_RE_ID11 10
#define can_wbo_re_id_e_WBO_RE_ID12 11
#define can_wbo_re_id_e_WBO_RE_ID13 12
#define can_wbo_re_id_e_WBO_RE_ID14 13
#define can_wbo_re_id_e_WBO_RE_ID15 14
#define can_wbo_re_id_e_WBO_RE_ID16 15
#define can_wbo_re_id_e_WBO_RE_ID2 1
#define can_wbo_re_id_e_WBO_RE_ID3 2
#define can_wbo_re_id_e_WBO_RE_ID4 3
#define can_wbo_re_id_e_WBO_RE_ID5 4
#define can_wbo_re_id_e_WBO_RE_ID6 5
#define can_wbo_re_id_e_WBO_RE_ID7 6
#define can_wbo_re_id_e_WBO_RE_ID8 7
#define can_wbo_re_id_e_WBO_RE_ID9 8
#define can_wbo_re_status_e_WBO_RE_BUSY 2
#define can_wbo_re_status_e_WBO_RE_DONE 1
#define can_wbo_re_status_e_WBO_RE_FAILED 3
#define can_wbo_re_status_e_WBO_RE_IDLE 0
#define can_wbo_type_e_AEM 1
#define can_wbo_type_e_auto_enum 0="RUSEFI",1="AEM",2="DISABLED"
#define can_wbo_type_e_DISABLED 2
#define can_wbo_type_e_enum "RusEFI", "AEM X-series", "Disabled/Analog"
#define can_wbo_type_e_RUSEFI 0
#define CanGpioType_auto_enum 0="NONE",1="DRT",2="MS"
#define CanGpioType_DRT 1
#define CanGpioType_enum "None", "DRT protocol", "MS protocol"
#define CanGpioType_MS 2
#define CanGpioType_NONE 0
#define canReWidebandHwIndex_enum "Idx 0", "Idx 1", "Idx 2", "Idx 3", "Idx 4", "Idx 5", "Idx 6", "Idx 7", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID"
#define CLT_CRANKING_CURVE_SIZE 8
#define CLT_CRANKING_TAPER_CURVE_SIZE 6
#define CLT_CURVE_SIZE 16
#define CLT_FUEL_CURVE_SIZE 16
#define CLT_IDLE_TABLE_CLT_SIZE 8
#define CLT_IDLE_TABLE_RPM_SIZE 2
#define CLT_LIMITER_CURVE_SIZE 4
#define CLT_TIMING_LOAD_AXIS_SIZE 5
#define CLT_TIMING_TEMP_AXIS_SIZE 5
#define CLT_UPPER_LIMIT 250
#define CLT_UPPER_VALIDATION_LIMIT 250
#define CMD_AC_RELAY_BENCH "acrelaybench"
#define CMD_ALTERNATOR_PIN "set_alternator_pin"
#define CMD_BOOST_BENCH "boostbench"
#define CMD_BOOST_PIN "set_boost_pin"
#define CMD_BURNCONFIG "burnconfig"
#define CMD_DATE "date"
#define CMD_DISABLE "disable"
#define CMD_ECU_UNLOCK "unlock"
#define CMD_ENABLE "enable"
#define CMD_ENGINE_TYPE "engine_type"
#define CMD_ENGINESNIFFERRPMTHRESHOLD "engineSnifferRpmThreshold"
#define CMD_ETB_DUTY "set_etb_duty"
#define CMD_EXTERNAL_STIMULATION "ext_stimulation"
#define CMD_FAN2_BENCH "fan2bench"
#define CMD_FAN_BENCH "fanbench"
#define CMD_FUEL_BENCH "fuelbench"
#define CMD_FUEL_PUMP_BENCH "fuelpumpbench"
#define CMD_FUNCTIONAL_TEST_MODE "test_mode"
#define CMD_GET "get"
#define CMD_HPFP_BENCH "hpfpbench"
#define CMD_IDLE_BENCH "idlebench"
#define CMD_IDLE_PIN "set_idle_pin"
#define CMD_IGNITION "ignition"
#define CMD_IGNITION_PIN "set_ignition_pin"
#define CMD_INDIVIDUAL_INJECTION "set_individual_coils_ignition"
#define CMD_INJECTION "injection"
#define CMD_INJECTION_PIN "set_injection_pin"
#define CMD_LOGIC_PIN "set_logic_input_pin"
#define CMD_LUA_RESET "luareset"
#define CMD_MIL_BENCH "milbench"
#define CMD_PINS "pins"
#define CMD_PWM "pwm"
#define CMD_REBOOT "reboot"
#define CMD_REBOOT_DFU "reboot_dfu"
#define CMD_REBOOT_OPENBLT "reboot_openblt"
#define CMD_RESET_ENGINE_SNIFFER "reset_engine_chart"
#define CMD_RESET_SENSOR_MOCKS "reset_sensor_mocks"
#define CMD_RESET_SIMULATOR "reset_simulator"
#define CMD_RPM "rpm"
#define CMD_SELF_STIMULATION "self_stimulation"
#define CMD_SET "set"
#define CMD_SET_SENSOR_MOCK "set_sensor_mock"
#define CMD_SPARK_BENCH "sparkbench"
#define CMD_STARTER_BENCH "starterbench"
#define CMD_TRIGGER_HW_INPUT "trigger_hw_input"
#define CMD_TRIGGER_PIN "set_trigger_input_pin"
#define CMD_TRIGGER_SIMULATOR_PIN "set_trigger_simulator_pin"
#define CMD_TRIGGERINFO "triggerinfo"
#define CMD_VSS_PIN "vss_pin"
#define CMD_WRITECONFIG "writeconfig"
#define COIL_1_NAME "Spark #1"
#define COIL_2_NAME "Spark #2"
#define COMMANDS_FROM_FILE
#define COMPOSITE_PACKET_SIZE 8
#define CONSOLE_DATA_PROTOCOL_TAG " @"
#define CRANKING_ADVANCE_CURVE_SIZE 4
#define CRANKING_CLT_IDLE_CURVE_SIZE 8
#define cranking_condition_e_auto_enum 0="CCNONE",1="CC_BRAKE",2="CC_CLUTCH",3="CC_CLUTCH_DOWN"
#define cranking_condition_e_CC_BRAKE 1
#define cranking_condition_e_CC_CLUTCH 2
#define cranking_condition_e_CC_CLUTCH_DOWN 3
#define cranking_condition_e_CCNONE 0
#define cranking_condition_e_enum "None", "Brake", "Clutch Up", "Clutch Down"
#define CRANKING_CURVE_SIZE 8
#define CRANKING_CYCLE_CLT_SIZE 4
#define CRANKING_ENRICH_CLT_COUNT 6
#define CRANKING_ENRICH_COUNT 6
#define CRANKING_FLEX_SIZE 4
#define cranking_parameters_s_size 4
#define CRITICAL_BUFFER_SIZE 120
#define CRITICAL_PREFIX "CRITICAL"
#define CYLINDER_BORE_MULTIPLIER 1
#define CYLINDER_BORE_TOOLTIP "Cylinder diameter in mm"
#define CYLINDER_BORE_UNITS "mm"
#define DAC_OUTPUT_COUNT 2
#define dc_function_e_auto_enum 0="DC_None",5="DC_Gpio",3="DC_IdleValve",1="DC_Throttle1",2="DC_Throttle2",4="DC_Wastegate"
#define dc_function_e_DC_Gpio 5
#define dc_function_e_DC_IdleValve 3
#define dc_function_e_DC_None 0
#define dc_function_e_DC_Throttle1 1
#define dc_function_e_DC_Throttle2 2
#define dc_function_e_DC_Wastegate 4
#define dc_io_size 8
#define DC_PER_STEPPER 2
#define debug_mode_e_auto_enum 0="DBG_0",1="DBG_1",10="DBG_10",11="DBG_11",12="DBG_12",13="DBG_13",14="DBG_14",16="DBG_16",19="DBG_19",2="DBG_2",20="DBG_20",21="DBG_21",22="DBG_22",24="DBG_24",25="DBG_25",26="DBG_26",27="DBG_27",29="DBG_29",3="DBG_3",32="DBG_32",33="DBG_33",34="DBG_34",35="DBG_35",36="DBG_36",37="DBG_37",38="DBG_38",4="DBG_4",43="DBG_43",46="DBG_46",5="DBG_5",6="DBG_6",7="DBG_7",8="DBG_8",9="DBG_9",40="DBG_COMPOSITE_LOG",44="DBG_DYNO_VIEW",17="DBG_ELECTRONIC_THROTTLE_PID",39="DBG_ETB_AUTOTUNE",18="DBG_EXECUTOR",30="DBG_ION",15="DBG_KNOCK",45="DBG_LOGIC_ANALYZER",48="DBG_LUA",28="DBG_METRICS",47="DBG_TCU",31="DBG_TLE8888",41="DBG_UNUSED41",42="DBG_UNUSED_42",23="UNUSED23"
#define debug_mode_e_DBG_0 0
#define debug_mode_e_DBG_1 1
#define debug_mode_e_DBG_10 10
#define debug_mode_e_DBG_11 11
#define debug_mode_e_DBG_12 12
#define debug_mode_e_DBG_13 13
#define debug_mode_e_DBG_14 14
#define debug_mode_e_DBG_16 16
#define debug_mode_e_DBG_19 19
#define debug_mode_e_DBG_2 2
#define debug_mode_e_DBG_20 20
#define debug_mode_e_DBG_21 21
#define debug_mode_e_DBG_22 22
#define debug_mode_e_DBG_24 24
#define debug_mode_e_DBG_25 25
#define debug_mode_e_DBG_26 26
#define debug_mode_e_DBG_27 27
#define debug_mode_e_DBG_29 29
#define debug_mode_e_DBG_3 3
#define debug_mode_e_DBG_32 32
#define debug_mode_e_DBG_33 33
#define debug_mode_e_DBG_34 34
#define debug_mode_e_DBG_35 35
#define debug_mode_e_DBG_36 36
#define debug_mode_e_DBG_37 37
#define debug_mode_e_DBG_38 38
#define debug_mode_e_DBG_4 4
#define debug_mode_e_DBG_43 43
#define debug_mode_e_DBG_46 46
#define debug_mode_e_DBG_5 5
#define debug_mode_e_DBG_6 6
#define debug_mode_e_DBG_7 7
#define debug_mode_e_DBG_8 8
#define debug_mode_e_DBG_9 9
#define debug_mode_e_DBG_COMPOSITE_LOG 40
#define debug_mode_e_DBG_DYNO_VIEW 44
#define debug_mode_e_DBG_ELECTRONIC_THROTTLE_PID 17
#define debug_mode_e_DBG_ETB_AUTOTUNE 39
#define debug_mode_e_DBG_EXECUTOR 18
#define debug_mode_e_DBG_ION 30
#define debug_mode_e_DBG_KNOCK 15
#define debug_mode_e_DBG_LOGIC_ANALYZER 45
#define debug_mode_e_DBG_LUA 48
#define debug_mode_e_DBG_METRICS 28
#define debug_mode_e_DBG_TCU 47
#define debug_mode_e_DBG_TLE8888 31
#define debug_mode_e_DBG_UNUSED41 41
#define debug_mode_e_DBG_UNUSED_42 42
#define debug_mode_e_enum "INVALID", "TPS acceleration enrichment", "INVALID", "Stepper Idle Control", "Engine Load accl enrich", "Trigger Counters", "Soft Spark Cut", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "SD card", "sr5", "Knock", "INVALID", "Electronic Throttle", "Executor", "Bench Test / TS commands", "INVALID", "Analog inputs #1", "INSTANT_RPM", "INVALID", "Status", "INVALID", "INVALID", "MAP", "Metrics", "INVALID", "Ion Sense", "TLE8888", "Analog inputs #2", "Dwell Metric", "INVALID", "INVALID", "Boost Control", "INVALID", "INVALID", "ETB Autotune", "Composite Log", "INVALID", "INVALID", "INVALID", "Dyno_View", "Logic_Analyzer", "INVALID", "TCU", "Lua"
#define debug_mode_e_UNUSED23 23
#define DEFAULT_RPM_AXIS_HIGH_VALUE 7000
#define DEFAULT_SELT_STIM_RPM 1200
