Antonecu/fw-custom-example/generated/controllers/generated/rusefi_generated_mega_stm32f4xx.h
#define DEFAULT_SELT_STIM_VVT0 23
#define DEFAULT_SOLENOID_FREQUENCY 300
#define DIALOG_NAME_VEHICLE_INFORMATION "Vehicle Information"
#define DIGIPOT_COUNT 4
#define DISPLACEMENT_DIGITS 3
#define DISPLACEMENT_MAX 65
#define DISPLACEMENT_MULTIPLIER 1
#define DISPLACEMENT_TOOLTIP "Engine displacement in litres"
#define DISPLACEMENT_UNITS "L"
#define display_mode_e_DM_HD44780 1
#define display_mode_e_DM_HD44780_OVER_PCF8574 2
#define display_mode_e_DM_NONE 0
#define DWELL_CURVE_SIZE 8
#define DYNO_CAR_CAR_MASS_TOOLTIP "Full car mass"
#define DYNO_CAR_CAR_MASS_UNITS "Kg"
#define DYNO_CAR_CARGO_MASS_TOOLTIP "Mass of passengers and cargo"
#define DYNO_CAR_CARGO_MASS_UNITS "Kg"
#define DYNO_CAR_COEFF_OF_DRAG_STEP_UNITS "Coeff"
#define DYNO_CAR_COEFF_OF_DRAG_TOOLTIP "Resistance of an car in air, for example see list of popular cars: https://ecomodder.com/wiki/Vehicle_Coefficient_of_Drag_List"
#define DYNO_CAR_FRONTAL_AREA_TOOLTIP "The frontal area A represents the frontal projection of the car's area"
#define DYNO_CAR_FRONTAL_AREA_UNITS "m2"
#define DYNO_CAR_GEAR_FINAL_DRIVE_TOOLTIP "Final drive gear ratio"
#define DYNO_CAR_GEAR_FINAL_DRIVE_UNITS "Units"
#define DYNO_CAR_GEAR_PRIMARY_REDUCTION_TOOLTIP "Primary reduction"
#define DYNO_CAR_GEAR_PRIMARY_REDUCTION_UNITS "Units"
#define DYNO_CAR_GEAR_RATIO_TOOLTIP "Ratio of the gear on which the measurement will be carried out, usually the gear is selected whose ratio is closest to 1"
#define DYNO_CAR_GEAR_RATIO_UNITS "Units"
#define DYNO_CAR_WHEEL_ASPECT_RATIO_TOOLTIP "Tyre height"
#define DYNO_CAR_WHEEL_ASPECT_RATIO_UNITS "Aspect Ratio (height)"
#define DYNO_CAR_WHEEL_DIA_INCH_TOOLTIP "Disc diameter"
#define DYNO_CAR_WHEEL_DIA_INCH_UNITS "Inch"
#define DYNO_CAR_WHEEL_TIRE_WIDTH_TOOLTIP "Tyre width"
#define DYNO_CAR_WHEEL_TIRE_WIDTH_UNITS "Width mm"
#define DYNO_RPM_STEP_TOOLTIP "RPM Trim Window, Leave on 100 if you dont know what this does"
#define DYNO_RPM_STEP_UNITS "Rpm"
#define DYNO_SAE_BARO_TOOLTIP "Atmospheric pressure"
#define DYNO_SAE_BARO_UNITS "KPa"
#define DYNO_SAE_RELATIVE_HUMIDITY_TOOLTIP "Relative humidity of air"
#define DYNO_SAE_RELATIVE_HUMIDITY_UNITS "%"
#define DYNO_SAE_TEMPERATURE_C_TOOLTIP "Air temperature"
#define DYNO_SAE_TEMPERATURE_C_UNITS "C"
#define EFI_CAN_BUS_COUNT 2
#define EFI_CAN_CANFD FALSE
#define ego_sensor_e_auto_enum 0="ES_BPSX_D1",2="ES_14Point7_Free",6="ES_AEM",5="ES_Custom",1="ES_Innovate_MTX_L",4="ES_PLX"
#define ego_sensor_e_enum "BPSX", "Innovate", "14Point7", "INVALID", "PLX", "Custom", "AEM"
#define ego_sensor_e_ES_14Point7_Free 2
#define ego_sensor_e_ES_AEM 6
#define ego_sensor_e_ES_BPSX_D1 0
#define ego_sensor_e_ES_Custom 5
#define ego_sensor_e_ES_Innovate_MTX_L 1
#define ego_sensor_e_ES_PLX 4
#define egoSettings_NAME "CAN O2 sensors"
#define EGT_CHANNEL_COUNT 8
#define engine_configuration_s_size 4268
#define engine_load_mode_e_auto_enum 0="LM_SPEED_DENSITY",2="LM_ALPHA_N",3="LM_LUA",1="LM_REAL_MAF",4="UNSUPPORTED_ENUM_VALUE"
#define engine_load_mode_e_LM_ALPHA_N 2
#define engine_load_mode_e_LM_LUA 3
#define engine_load_mode_e_LM_REAL_MAF 1
#define engine_load_mode_e_LM_SPEED_DENSITY 0
#define engine_load_mode_e_UNSUPPORTED_ENUM_VALUE 4
#define ENGINE_MAKE_BMW "BMW"
#define ENGINE_MAKE_FORD "Ford"
#define ENGINE_MAKE_GM "GM"
#define ENGINE_MAKE_HONDA "Honda"
#define ENGINE_MAKE_Hyundai "Hyundai"
#define ENGINE_MAKE_LADA "Lada"
#define ENGINE_MAKE_MAZDA "Mazda"
#define ENGINE_MAKE_MERCEDES "Mercedes"
#define ENGINE_MAKE_NISSAN "Nissan"
#define ENGINE_MAKE_SUBARU "Subaru"
#define ENGINE_MAKE_TOYOTA "Toyota"
#define ENGINE_MAKE_VAG "VAG"
#define ENGINE_NOISE_CURVE_SIZE 16
#define ENGINE_SNIFFER_UNIT_US 10
#define engine_type_e_auto_enum 0="DEFAULT_FRANKENSO",22="BMW_M52",50="BMW_M73_MRE",51="BMW_M73_MRE_SLAVE",16="BMW_N52",38="DISCOVERY_PDM",2="DODGE_NEON_1995",64="DODGE_RAM",61="EEPROM_BENCH_ENGINE",58="ETB_BENCH_ENGINE",21="ET_BOSCH_QUICK_START",46="ET_DODGE_NEON_2003",24="ET_TEST_WITH_BOSCH_QUICK_START",3="FORD_ASPIRE_1996",11="FORD_COYOTE",67="FORD_ECOBOOST",14="FORD_ESCORT_GT",7="FORD_INLINE_6_1995",40="FRANKENSO_BMW_M73_F",41="FRANKENSO_MIATA_NA6_MAP",59="FRANKENSO_TEST_33810",15="FUEL_BENCH",47="GM_LCV",65="GM_LNF",55="GM_LTG",98="GM_SBC",5="GM_SBC_GEN3",27="GM_SBC_GEN4",49="GM_SBC_GEN5",8="GY6_139QMB",6="HARLEY",84="HELLEN_121_NISSAN_4_CYL",72="HELLEN_121_NISSAN_6_CYL",85="HELLEN_121_NISSAN_8_CYL",87="HELLEN_121_NISSAN_ALMERA_N16",71="HELLEN_121_VAG_4_CYL",81="HELLEN_121_VAG_8_CYL",78="HELLEN_121_VAG_V6_CYL",79="HELLEN_121_VAG_VR6_CYL",36="HELLEN_128_MERCEDES_4_CYL",88="HELLEN_128_MERCEDES_6_CYL",89="HELLEN_128_MERCEDES_8_CYL",82="HELLEN_154_HYUNDAI_COUPE_BK1",95="HELLEN_154_HYUNDAI_COUPE_BK2",76="HELLEN_154_VAG",75="HELLEN_2CHAN_STIM_QC",74="HELLEN_4CHAN_STIM_QC",57="HELLEN_HONDA_BCM",43="HONDA_600",90="HONDA_K",66="HONDA_OBD1",91="HONDA_OBD2A",104="HYUNDAI_PB",60="L9779_BENCH_ENGINE",54="MAVERICK_X3",34="MAZDA_MIATA_NA6",80="MAZDA_MIATA_NA94",10="MAZDA_MIATA_NA96",83="MAZDA_MIATA_NB1",69="MAZDA_MIATA_NB2",86="MAZDA_MIATA_NB2_36",20="MAZDA_MIATA_NC",33="ME17_9_MISC",68="MERCEDES_M111",1="MIATA_PROTEUS_TCU",99="MINIMAL_PINS",12="MITSUBISHI_3A92",23="MRE_BODY_CONTROL",4="MRE_SECONDARY_CAN",37="MRE_SUBARU_EJ18",62="MRE_VW_B6",35="POLARIS",9="POLARIS_RZR",30="PROTEUS_ANALOG_PWM_TEST",63="PROTEUS_BMW_M73",25="PROTEUS_LUA_DEMO",103="PROTEUS_NISSAN_VQ35",73="PROTEUS_STIM_QC",39="PROTEUS_VW_B6",29="SACHS",92="SIMULATOR_CONFIG",56="SUBARU_2011",70="SUBARU_EG33",17="TCU_4R70W",100="TEST_100",101="TEST_101",18="TEST_33816",28="TEST_CRANK_ENGINE",48="TEST_DC_WASTEGATE_DISCOVERY",26="TEST_ENGINE",45="TEST_ENGINE_VVT",52="TEST_ISSUE_366_BOTH",53="TEST_ISSUE_366_RISE",93="TEST_ISSUE_6451",19="TEST_ROTARY",13="TOYOTA_1NZ_FE",44="TOYOTA_2JZ_GTE_VVTi",102="UNUSED102",31="UNUSED31",42="UNUSED42",94="UNUSED94",105="UNUSED_105",97="UNUSED_97",77="VAG_5_CYL",32="VW_ABA",96="WASTEGATE_PROTEUS_TEST"
#define engine_type_e_BMW_M52 22
#define engine_type_e_BMW_M73_MRE 50
#define engine_type_e_BMW_M73_MRE_SLAVE 51
#define engine_type_e_BMW_N52 16
#define engine_type_e_DEFAULT_FRANKENSO 0
#define engine_type_e_DISCOVERY_PDM 38
#define engine_type_e_DODGE_NEON_1995 2
#define engine_type_e_DODGE_RAM 64
#define engine_type_e_EEPROM_BENCH_ENGINE 61
#define engine_type_e_ET_BOSCH_QUICK_START 21
#define engine_type_e_ET_DODGE_NEON_2003 46
#define engine_type_e_ET_TEST_WITH_BOSCH_QUICK_START 24
#define engine_type_e_ETB_BENCH_ENGINE 58
#define engine_type_e_FORD_ASPIRE_1996 3
#define engine_type_e_FORD_COYOTE 11
#define engine_type_e_FORD_ECOBOOST 67
#define engine_type_e_FORD_ESCORT_GT 14
#define engine_type_e_FORD_INLINE_6_1995 7
#define engine_type_e_FRANKENSO_BMW_M73_F 40
#define engine_type_e_FRANKENSO_MIATA_NA6_MAP 41
#define engine_type_e_FRANKENSO_TEST_33810 59
#define engine_type_e_FUEL_BENCH 15
#define engine_type_e_GM_LCV 47
#define engine_type_e_GM_LNF 65
#define engine_type_e_GM_LTG 55
#define engine_type_e_GM_SBC 98
#define engine_type_e_GM_SBC_GEN3 5
#define engine_type_e_GM_SBC_GEN4 27
#define engine_type_e_GM_SBC_GEN5 49
#define engine_type_e_GY6_139QMB 8
#define engine_type_e_HARLEY 6
#define engine_type_e_HELLEN_121_NISSAN_4_CYL 84
#define engine_type_e_HELLEN_121_NISSAN_6_CYL 72
#define engine_type_e_HELLEN_121_NISSAN_8_CYL 85
#define engine_type_e_HELLEN_121_NISSAN_ALMERA_N16 87
#define engine_type_e_HELLEN_121_VAG_4_CYL 71
#define engine_type_e_HELLEN_121_VAG_8_CYL 81
#define engine_type_e_HELLEN_121_VAG_V6_CYL 78
#define engine_type_e_HELLEN_121_VAG_VR6_CYL 79
#define engine_type_e_HELLEN_128_MERCEDES_4_CYL 36
#define engine_type_e_HELLEN_128_MERCEDES_6_CYL 88
#define engine_type_e_HELLEN_128_MERCEDES_8_CYL 89
#define engine_type_e_HELLEN_154_HYUNDAI_COUPE_BK1 82
#define engine_type_e_HELLEN_154_HYUNDAI_COUPE_BK2 95
#define engine_type_e_HELLEN_154_VAG 76
#define engine_type_e_HELLEN_2CHAN_STIM_QC 75
#define engine_type_e_HELLEN_4CHAN_STIM_QC 74
#define engine_type_e_HELLEN_HONDA_BCM 57
#define engine_type_e_HONDA_600 43
#define engine_type_e_HONDA_K 90
#define engine_type_e_HONDA_OBD1 66
#define engine_type_e_HONDA_OBD2A 91
#define engine_type_e_HYUNDAI_PB 104
#define engine_type_e_L9779_BENCH_ENGINE 60
#define engine_type_e_MAVERICK_X3 54
#define engine_type_e_MAZDA_MIATA_NA6 34
#define engine_type_e_MAZDA_MIATA_NA94 80
#define engine_type_e_MAZDA_MIATA_NA96 10
#define engine_type_e_MAZDA_MIATA_NB1 83
#define engine_type_e_MAZDA_MIATA_NB2 69
#define engine_type_e_MAZDA_MIATA_NB2_36 86
#define engine_type_e_MAZDA_MIATA_NC 20
#define engine_type_e_ME17_9_MISC 33
#define engine_type_e_MERCEDES_M111 68
#define engine_type_e_MIATA_PROTEUS_TCU 1
#define engine_type_e_MINIMAL_PINS 99
#define engine_type_e_MITSUBISHI_3A92 12
#define engine_type_e_MRE_BODY_CONTROL 23
#define engine_type_e_MRE_SECONDARY_CAN 4
#define engine_type_e_MRE_SUBARU_EJ18 37
#define engine_type_e_MRE_VW_B6 62
#define engine_type_e_POLARIS 35
#define engine_type_e_POLARIS_RZR 9
#define engine_type_e_PROTEUS_ANALOG_PWM_TEST 30
#define engine_type_e_PROTEUS_BMW_M73 63
#define engine_type_e_PROTEUS_LUA_DEMO 25
#define engine_type_e_PROTEUS_NISSAN_VQ35 103
#define engine_type_e_PROTEUS_STIM_QC 73
#define engine_type_e_PROTEUS_VW_B6 39
#define engine_type_e_SACHS 29
#define engine_type_e_SIMULATOR_CONFIG 92
#define engine_type_e_SUBARU_2011 56
#define engine_type_e_SUBARU_EG33 70
#define engine_type_e_TCU_4R70W 17
#define engine_type_e_TEST_100 100
#define engine_type_e_TEST_101 101
#define engine_type_e_TEST_33816 18
#define engine_type_e_TEST_CRANK_ENGINE 28
#define engine_type_e_TEST_DC_WASTEGATE_DISCOVERY 48
#define engine_type_e_TEST_ENGINE 26
#define engine_type_e_TEST_ENGINE_VVT 45
#define engine_type_e_TEST_ISSUE_366_BOTH 52
#define engine_type_e_TEST_ISSUE_366_RISE 53
#define engine_type_e_TEST_ISSUE_6451 93
#define engine_type_e_TEST_ROTARY 19
#define engine_type_e_TOYOTA_1NZ_FE 13
#define engine_type_e_TOYOTA_2JZ_GTE_VVTi 44
#define engine_type_e_UNUSED102 102
#define engine_type_e_UNUSED31 31
#define engine_type_e_UNUSED42 42
#define engine_type_e_UNUSED94 94
#define engine_type_e_UNUSED_105 105
#define engine_type_e_UNUSED_97 97
#define engine_type_e_VAG_5_CYL 77
#define engine_type_e_VW_ABA 32
#define engine_type_e_WASTEGATE_PROTEUS_TEST 96
#define ENGINE_TYPES_DIALOG_NAME "Base Tunes"
#define engineSyncCam_enum "Intake First Bank", "Exhaust First Bank", "Intake Second Bank", "Exhaust Second Bank"
#define ETB2_TRIM_RPM_SIZE 6
#define ETB2_TRIM_SIZE 6
#define ETB_BIAS_CURVE_LENGTH 8
#define ETB_COUNT 2
#define ETB_HW_MAX_FREQUENCY 3000
#define ETHERNET_PORT 29001
#define FAN_PWM_CURVE_SIZE 8
#define FIELD_DISPLACEMENT displacement
#define FIELD_INJECTOR_FLOW injector.flow
#define firing_order_e_enum "One Cylinder", "1-3-4-2", "1-2-4-3", "1-3-2-4", "1-5-3-6-2-4", "1-8-4-3-6-5-7-2", "1-2-4-5-3", "1-4-2-5-3-6", "1-2", "1-2-3-4-5-6", "1-2-3", "1-8-7-2-6-5-4-3", "1-5-4-2-6-3-7-8 Mustang", "1-6-3-2-5-4", "1-10-9-4-3-6-5-8-7_2", "1-7-5-11-3-9-6-12-2-8-4-10", "1-7-4-10-2-8-6-12-3-9-5-11", "1-4-3-2", "1-12-5-8-3-10-6-7-2-11-4-9", "1-2-7-8-4-5-6-3", "1-3-7-2-6-5-4-8 HO", "1-2-3-4-5-6-7-8-9", "INVALID", "1-2-3-4-5-6-7-8-9-10-11-12", "1-3-2", "1-2-3-4-5-6-7-8", "1-5-4-8-6-3-7-2", "1-4-3-6-2-5", "1-8-7-3-6-5-4-2", "1-6-2-4-3-5", "1-6-5-4-3-2", "1-4-5-2-3-6", "1-5-4-8-3-7-2-6 Voodoo", "1-6-5-10-2-7-3-8-4-9", "1-8-6-2-7-3-4-5 F136", "1-2-3-4", "1-6-2-5-3-4"
#define FLASH_DATA_VERSION 260902
#define FLEX_TRANSIENT_CLT_SIZE 8
#define FLEX_TRANSIENT_ETH_SIZE 8
#define FLOW_LINEARIZATION_MASS_SIZE 2
#define FLOW_LINEARIZATION_PRESSURE_SIZE 2
#define FRONTEND_TITLE_BAR_NAME "rusEFI"
#define FT_BANK_COUNT 2
#define ft_region_e_ftRegionCruise 3
#define ft_region_e_ftRegionIdle 0
#define ft_region_e_ftRegionOverrun 1
#define ft_region_e_ftRegionPower 2
#define fuel_cyl_trim_s_size 16
#define FUEL_LEVEL_TABLE_COUNT 8
#define FUEL_LOAD_COUNT 16
#define fuel_pressure_sensor_mode_e_auto_enum 0="FPM_Absolute",2="FPM_Differential",1="FPM_Gauge"
#define fuel_pressure_sensor_mode_e_enum "Absolute", "Gauge", "Differential", "INVALID"
#define fuel_pressure_sensor_mode_e_FPM_Absolute 0
#define fuel_pressure_sensor_mode_e_FPM_Differential 2
#define fuel_pressure_sensor_mode_e_FPM_Gauge 1
#define FUEL_RPM_COUNT 16
#define FUEL_TRIM_SIZE 4
#define GAP_TRACKING_LENGTH 18
#define GAUGE_CATEGORY_BOOST_CONTROL "Boost Control"
#define GAUGE_CATEGORY_ECU_STATUS "ECU Status"
#define GAUGE_CATEGORY_ETB "ETB more"
#define GAUGE_CATEGORY_FUEL_MATH "Fuel: math"
#define GAUGE_CATEGORY_SENT "Sensors - SENT"
#define GAUGE_CATEGORY_SYNC "Sync"
#define GAUGE_CATEGORY_TIMING "Timing"
#define GAUGE_COIL_DWELL_TIME "Ignition: coil charge time"
#define GAUGE_LONG_NAME_AAT "Ambient Temperature"
#define GAUGE_LONG_NAME_CLT "Coolant temp"
#define GAUGE_LONG_NAME_IAT "Intake air temp"
#define GAUGE_LUA_FROM_0 -30000
#define GAUGE_LUA_FROM_1 -30000
#define GAUGE_LUA_FROM_2 -30000
#define GAUGE_LUA_FROM_3 -30000
#define GAUGE_LUA_FROM_4 -30000
#define GAUGE_LUA_FROM_5 -30000
#define GAUGE_LUA_FROM_6 -30000
#define GAUGE_LUA_FROM_7 -30000
#define GAUGE_LUA_TO_0 30000
#define GAUGE_LUA_TO_1 30000
#define GAUGE_LUA_TO_2 30000
#define GAUGE_LUA_TO_3 30000
#define GAUGE_LUA_TO_4 30000
#define GAUGE_LUA_TO_5 30000
#define GAUGE_LUA_TO_6 30000
#define GAUGE_LUA_TO_7 30000
#define GAUGE_NAME_AC_PRESSURE "A/C pressure"
#define GAUGE_NAME_ACCEL_LAT "Accel: Lateral"
#define GAUGE_NAME_ACCEL_LON "Accel: Longitudinal"
#define GAUGE_NAME_ACCEL_ROLL "Acceleration: Roll"
#define GAUGE_NAME_ACCEL_VERT "Accel: Vertical"
#define GAUGE_NAME_ACCEL_YAW "Acceleration: Yaw"
#define GAUGE_NAME_ADJUSTED_TIMING "Timing: ignition"
#define GAUGE_NAME_AFR "Air/Fuel Ratio"
#define GAUGE_NAME_AFR2 "Air/Fuel Ratio 2"
#define GAUGE_NAME_AFR2_GAS_SCALE "Air/Fuel Ratio 2 (Gas Scale)"
#define GAUGE_NAME_AFR_GAS_SCALE "Air/Fuel Ratio (Gas Scale)"
#define GAUGE_NAME_AIR_FLOW_ESTIMATE "Air: Flow estimate"
#define GAUGE_NAME_AIR_FLOW_MEASURED "MAF"
#define GAUGE_NAME_AIR_FLOW_MEASURED_2 "MAF #2"
#define GAUGE_NAME_AIR_MASS "Air: Cylinder airmass"
#define GAUGE_NAME_AUX_LINEAR_1 "Aux linear #1"
#define GAUGE_NAME_AUX_LINEAR_2 "Aux linear #2"
#define GAUGE_NAME_AUX_LINEAR_3 "Aux linear #3"
#define GAUGE_NAME_AUX_LINEAR_4 "Aux linear #4"
#define GAUGE_NAME_AUX_TEMP1 "Aux temp 1"
#define GAUGE_NAME_AUX_TEMP2 "Aux temp 2"
#define GAUGE_NAME_BARO_PRESSURE "Barometric pressure"
#define GAUGE_NAME_BOOST_CLOSED_LOOP "Boost: Closed loop"
#define GAUGE_NAME_BOOST_OPEN_LOOP "Boost: Open loop"
#define GAUGE_NAME_BOOST_OUTPUT "Boost: Output"
#define GAUGE_NAME_BOOST_TARGET "Boost: Target"
#define GAUGE_NAME_CAN_READ_OK "CAN: Rx"
#define GAUGE_NAME_CAN_WRITE_ERR "CAN: Tx err"
#define GAUGE_NAME_CAN_WRITE_OK "CAN: Tx OK"
#define GAUGE_NAME_CLT "CLT"
#define GAUGE_NAME_CPU_TEMP "ECU: CPU Temperature"
#define GAUGE_NAME_CURRENT_GEAR "TCU: Current Gear"
#define GAUGE_NAME_DEBUG_F1 "debug f1"
#define GAUGE_NAME_DEBUG_F2 "debug f2: iTerm"
#define GAUGE_NAME_DEBUG_F3 "debug f3: prevError"
#define GAUGE_NAME_DEBUG_F4 "debug f4: iParam"
#define GAUGE_NAME_DEBUG_F5 "debug f5: dParam"
#define GAUGE_NAME_DEBUG_F6 "debug f6: dTerm"
#define GAUGE_NAME_DEBUG_F7 "debug f7"
#define GAUGE_NAME_DEBUG_I1 "debug i1: pParam"
#define GAUGE_NAME_DEBUG_I2 "debug i2: offset"
#define GAUGE_NAME_DEBUG_I3 "debug i3"
#define GAUGE_NAME_DEBUG_I4 "debug i4"
#define GAUGE_NAME_DEBUG_I5 "debug i5"
#define GAUGE_NAME_DESIRED_GEAR "TCU: Desired Gear"
#define GAUGE_NAME_DETECTED_GEAR "Detected Gear"
#define GAUGE_NAME_DWELL_DUTY "Ignition: coil duty cycle"
#define GAUGE_NAME_ECU_TEMPERATURE "ECU temperature"
#define GAUGE_NAME_ENGINE_CRC16 "Engine CRC16"
#define GAUGE_NAME_ETB_DUTY "ETB: Duty"
#define GAUGE_NAME_ETB_ERROR "ETB: position error"
#define GAUGE_NAME_ETB_TARGET "ETB: position target"
#define GAUGE_NAME_FLEX "Flex Ethanol %"
#define GAUGE_NAME_FUEL_BARO_CORR "Fuel: Barometric pressure mult"
#define GAUGE_NAME_FUEL_BASE "Fuel: base cycle mass"
#define GAUGE_NAME_FUEL_CHARGE_TEMP "Fuel: Estimated charge temperature"
#define GAUGE_NAME_FUEL_CLT_CORR "Fuel: CLT correction"
#define GAUGE_NAME_FUEL_CONSUMPTION "Fuel: Total consumed"
#define GAUGE_NAME_FUEL_CORRECTION_REFERENCE_PRESSURE "Fuel: corr reference pressure"
#define GAUGE_NAME_FUEL_CRANKING "Fuel: cranking"
#define GAUGE_NAME_FUEL_FLOW "Fuel: Flow rate"
#define GAUGE_NAME_FUEL_IAT_CORR "Fuel: IAT correction"
#define GAUGE_NAME_FUEL_INJ_DUTY "Fuel: injector duty cycle"
#define GAUGE_NAME_FUEL_INJ_DUTY_STAGE_2 "Fuel: injector duty cycle stage 2"
#define GAUGE_NAME_FUEL_INJECTION_TIMING "Fuel: Injection timing SOI"
#define GAUGE_NAME_FUEL_LAST_INJECTION "Fuel: Last inj pulse width"
#define GAUGE_NAME_FUEL_LAST_INJECTION_RATIO "Fuel: Last inj pulse growth"
#define GAUGE_NAME_FUEL_LAST_INJECTION_RATIO_STAGE_2 "Fuel: Last inj pulse growth stg 2"
#define GAUGE_NAME_FUEL_LAST_INJECTION_STAGE_2 "Fuel: Last inj pulse width stg 2"
#define GAUGE_NAME_FUEL_LEVEL "Fuel level"
#define GAUGE_NAME_FUEL_LOAD "Fuel: Load"
#define GAUGE_NAME_FUEL_LTFT_1 "Long Term Fuel Trim Bank 1"
#define GAUGE_NAME_FUEL_LTFT_2 "Long Term Fuel Trim Bank 2"
#define GAUGE_NAME_FUEL_LTFT_ACC_1 "LTFT learned accumulator: Bank 1"
#define GAUGE_NAME_FUEL_LTFT_ACC_2 "LTFT learned accumulator: Bank 2"
#define GAUGE_NAME_FUEL_PRESSURE_HIGH "Fuel pressure (high)"
#define GAUGE_NAME_FUEL_PRESSURE_HIGH_UNITS "bar"
#define GAUGE_NAME_FUEL_PRESSURE_LOW "Fuel pressure (low)"
#define GAUGE_NAME_FUEL_PRESSURE_LOW_UNITS "kPa"
#define GAUGE_NAME_FUEL_RUNNING "Fuel: running"
#define GAUGE_NAME_FUEL_STFT_1 "Short Term Fuel Trim: Bank 1"
#define GAUGE_NAME_FUEL_STFT_2 "Short Term Fuel Trim: Bank 2"
#define GAUGE_NAME_FUEL_STFT_INPUT_1 "STFT input lambda error: Bank 1"
#define GAUGE_NAME_FUEL_STFT_INPUT_2 "STFT input lambda error: Bank 2"
#define GAUGE_NAME_FUEL_TEMPERATURE "Fuel Temperature"
#define GAUGE_NAME_FUEL_TPS_EXTRA "Fuel: TPS acceleration add fuel ms"
#define GAUGE_NAME_FUEL_VE "Fuel: VE"
#define GAUGE_NAME_FUEL_WALL_AMOUNT "Fuel: wall amount"
#define GAUGE_NAME_FUEL_WALL_CORRECTION "Fuel: wall correction"
#define GAUGE_NAME_FW_VERSION "ECU: Software Version"
#define GAUGE_NAME_GEAR_RATIO "Gearbox Ratio"
#define GAUGE_NAME_GYRO_YAW "Gyro: Yaw rate"
#define GAUGE_NAME_IAC "Idle: Position"
#define GAUGE_NAME_IAT "Intake Air IAT"
#define GAUGE_NAME_IDLE_POSITION "Idle: Position sensor"
#define GAUGE_NAME_IGNITION_LOAD "Ignition: load"
#define GAUGE_NAME_IGNITION_MODE "Ignition: Mode"
#define GAUGE_NAME_INJECTION_MODE "Fuel: Injection mode"
#define GAUGE_NAME_INJECTOR_LAG "Fuel: injector lag"
#define GAUGE_NAME_ISS "TCU: Input Shaft Speed"
#define GAUGE_NAME_KNOCK_1 "knock 1"
#define GAUGE_NAME_KNOCK_10 "knock 10"
#define GAUGE_NAME_KNOCK_11 "knock 11"
#define GAUGE_NAME_KNOCK_12 "knock 12"
#define GAUGE_NAME_KNOCK_2 "knock 2"
#define GAUGE_NAME_KNOCK_3 "knock 3"
#define GAUGE_NAME_KNOCK_4 "knock 4"
#define GAUGE_NAME_KNOCK_5 "knock 5"
#define GAUGE_NAME_KNOCK_6 "knock 6"
#define GAUGE_NAME_KNOCK_7 "knock 7"
#define GAUGE_NAME_KNOCK_8 "knock 8"
#define GAUGE_NAME_KNOCK_9 "knock 9"
#define GAUGE_NAME_KNOCK_COUNTER "Knock: Count"
#define GAUGE_NAME_KNOCK_FREQ "knock: frequency"
#define GAUGE_NAME_KNOCK_LEVEL "Knock: Current level"
#define GAUGE_NAME_KNOCK_RETARD "Knock: Retard"
#define GAUGE_NAME_LAMBDA "Lambda"
#define GAUGE_NAME_LAMBDA2 "Lambda 2"
#define GAUGE_NAME_LAST_ERROR "Warning: last"
#define GAUGE_NAME_LUA_0 "Lua Gauge 1"
#define GAUGE_NAME_LUA_1 "Lua Gauge 2"
#define GAUGE_NAME_LUA_2 "Lua Gauge 3"
#define GAUGE_NAME_LUA_3 "Lua Gauge 4"
#define GAUGE_NAME_LUA_4 "Lua Gauge 5"
#define GAUGE_NAME_LUA_5 "Lua Gauge 6"
#define GAUGE_NAME_LUA_6 "Lua Gauge 7"
#define GAUGE_NAME_LUA_7 "Lua Gauge 8"
#define GAUGE_NAME_MAF "MAF"
#define GAUGE_NAME_MAP "MAP"
#define GAUGE_NAME_OIL_PRESSURE "Oil Pressure"
#define GAUGE_NAME_OIL_PRESSURE_UNITS "kPa"
#define GAUGE_NAME_OIL_TEMPERATURE "Oil Temperature"
#define GAUGE_NAME_RAW_FUEL_PRESSURE_HIGH "Fuel pressure raw (high)"
#define GAUGE_NAME_RAW_FUEL_PRESSURE_LOW "Fuel pressure raw (low)"
#define GAUGE_NAME_RPM "RPM"
#define GAUGE_NAME_TARGET_AFR "Fuel: target AFR"
#define GAUGE_NAME_TARGET_LAMBDA "Fuel: target lambda"
#define GAUGE_NAME_TC_RATIO "TCU: Torque Converter Ratio"
#define GAUGE_NAME_TCHARGE "Air: SD tCharge"
#define GAUGE_NAME_THROTTLE_PEDAL "Throttle pedal position"
#define GAUGE_NAME_TIME "Time"
#define GAUGE_NAME_TIMING_ADVANCE "Timing: base ignition"
#define GAUGE_NAME_TPS "TPS"
#define GAUGE_NAME_TPS2 "TPS2"
#define GAUGE_NAME_TRG_ERR "Trigger Error Counter"
#define GAUGE_NAME_TRG_GAP "Sync: Trigger Latest Ratio"
#define GAUGE_NAME_TUNE_CRC16 "Tune CRC16"
#define GAUGE_NAME_TURBO_SPEED "Turbocharger Speed"
#define GAUGE_NAME_UPTIME "Uptime"
#define GAUGE_NAME_VBAT "VBatt"
#define GAUGE_NAME_VERSION "firmware"
#define GAUGE_NAME_VIGN "VIgn"
#define GAUGE_NAME_VVS "Vehicle Speed"
#define GAUGE_NAME_VVT_B1E "VVT: bank 1 exhaust"
#define GAUGE_NAME_VVT_B1I "VVT: bank 1 intake"
#define GAUGE_NAME_VVT_B2E "VVT: bank 2 exhaust"
#define GAUGE_NAME_VVT_B2I "VVT: bank 2 intake"
#define GAUGE_NAME_VVT_TARGET_B1E "VVT: bank 1 exhaust target"
#define GAUGE_NAME_VVT_TARGET_B1I "VVT: bank 1 intake target"
#define GAUGE_NAME_VVT_TARGET_B2E "VVT: bank 2 exhaust target"
#define GAUGE_NAME_VVT_TARGET_B2I "VVT: bank 2 intake target"
#define GAUGE_NAME_WARNING_COUNT "Warning count"
#define GAUGE_NAME_WARNING_COUNTER "Warning: counter"
#define GAUGE_NAME_WARNING_LAST "Warning: last"
#define GAUGE_NAME_WG_POSITION "Wastegate position sensor"
#define GAUGE_PRECISION_TEMPERATURE_C 1
#define GAUGE_PRECISION_TEMPERATURE_F 2
#define GAUGES_DECLARATIONS_FILE "tunerstudio/gauge_declarations.ini"
#define gear_controller_e_enum "None", "Button Shift", "Automatic", "Generic"
#define GEAR_DETECTION_DIALOG_NAME "Gear Detection"
#define gear_e_GEAR_1 1
#define gear_e_GEAR_2 2
#define gear_e_GEAR_3 3
#define gear_e_GEAR_4 4
#define gear_e_NEUTRAL 0
#define gear_e_REVERSE -1
#define GearControllerMode_auto_enum 0="None",2="Automatic",1="ButtonShift",3="Generic"
#define GearControllerMode_Automatic 2
#define GearControllerMode_ButtonShift 1
#define GearControllerMode_Generic 3
#define GearControllerMode_None 0
#define Gpio_A0 2
#define Gpio_A1 3
#define Gpio_A10 12
#define Gpio_A11 13
#define Gpio_A12 14
#define Gpio_A13 15
#define Gpio_A14 16
#define Gpio_A15 17
#define Gpio_A2 4
#define Gpio_A3 5
#define Gpio_A4 6
#define Gpio_A5 7
#define Gpio_A6 8
#define Gpio_A7 9
#define Gpio_A8 10
#define Gpio_A9 11
