Antonecu/fw-custom-example/generated/controllers/generated/rusefi_generated_mega_stm32f4xx.h
#define Gpio_auto_enum 0="Unassigned",2="A0",3="A1",12="A10",13="A11",14="A12",15="A13",16="A14",17="A15",4="A2",5="A3",6="A4",7="A5",8="A6",9="A7",10="A8",11="A9",18="B0",19="B1",28="B10",29="B11",30="B12",31="B13",32="B14",33="B15",20="B2",21="B3",22="B4",23="B5",24="B6",25="B7",26="B8",27="B9",34="C0",35="C1",44="C10",45="C11",46="C12",47="C13",48="C14",49="C15",36="C2",37="C3",38="C4",39="C5",40="C6",41="C7",42="C8",43="C9",281="CAN_PIN_0",282="CAN_PIN_1",283="CAN_PIN_2",284="CAN_PIN_3",285="CAN_PIN_4",286="CAN_PIN_5",287="CAN_PIN_6",288="CAN_PIN_7",50="D0",51="D1",60="D10",61="D11",62="D12",63="D13",64="D14",65="D15",52="D2",53="D3",54="D4",55="D5",56="D6",57="D7",58="D8",59="D9",66="E0",67="E1",76="E10",77="E11",78="E12",79="E13",80="E14",81="E15",68="E2",69="E3",70="E4",71="E5",72="E6",73="E7",74="E8",75="E9",82="F0",83="F1",92="F10",93="F11",94="F12",95="F13",96="F14",97="F15",84="F2",85="F3",86="F4",87="F5",88="F6",89="F7",90="F8",91="F9",98="G0",99="G1",108="G10",109="G11",110="G12",111="G13",112="G14",113="G15",100="G2",101="G3",102="G4",103="G5",104="G6",105="G7",106="G8",107="G9",114="H0",115="H1",124="H10",125="H11",126="H12",127="H13",128="H14",129="H15",116="H2",117="H3",118="H4",119="H5",120="H6",121="H7",122="H8",123="H9",361="HBRIDGE_1_OUT",362="HBRIDGE_2_OUT",130="I0",131="I1",140="I10",141="I11",142="I12",143="I13",144="I14",145="I15",132="I2",133="I3",134="I4",135="I5",136="I6",137="I7",138="I8",139="I9",1="Invalid",146="J0",147="J1",156="J10",157="J11",158="J12",159="J13",160="J14",161="J15",148="J2",149="J3",150="J4",151="J5",152="J6",153="J7",154="J8",155="J9",162="K0",163="K1",172="K10",173="K11",174="K12",175="K13",176="K14",177="K15",164="K2",165="K3",166="K4",167="K5",168="K6",169="K7",170="K8",171="K9",247="L9779_IGN_1",248="L9779_IGN_2",249="L9779_IGN_3",250="L9779_IGN_4",251="L9779_OUT_1",260="L9779_OUT_10",261="L9779_OUT_11",262="L9779_OUT_12",263="L9779_OUT_13",264="L9779_OUT_14",265="L9779_OUT_15",266="L9779_OUT_16",267="L9779_OUT_17",268="L9779_OUT_18",269="L9779_OUT_19",252="L9779_OUT_2",270="L9779_OUT_20",275="L9779_OUT_25",276="L9779_OUT_26",277="L9779_OUT_27",278="L9779_OUT_28",253="L9779_OUT_3",254="L9779_OUT_4",255="L9779_OUT_5",256="L9779_OUT_6",257="L9779_OUT_7",258="L9779_OUT_8",259="L9779_OUT_9",271="L9779_OUT_A",272="L9779_OUT_B",273="L9779_OUT_C",274="L9779_OUT_D",279="L9779_OUT_MRD",280="L9779_PIN_KEY",309="MC33810_0_GD_0",310="MC33810_0_GD_1",311="MC33810_0_GD_2",312="MC33810_0_GD_3",305="MC33810_0_OUT_0",306="MC33810_0_OUT_1",307="MC33810_0_OUT_2",308="MC33810_0_OUT_3",317="MC33810_1_GD_0",318="MC33810_1_GD_1",319="MC33810_1_GD_2",320="MC33810_1_GD_3",313="MC33810_1_OUT_0",314="MC33810_1_OUT_1",315="MC33810_1_OUT_2",316="MC33810_1_OUT_3",178="MC33972_PIN_1",187="MC33972_PIN_10",188="MC33972_PIN_11",189="MC33972_PIN_12",190="MC33972_PIN_13",191="MC33972_PIN_14",192="MC33972_PIN_15",193="MC33972_PIN_16",194="MC33972_PIN_17",195="MC33972_PIN_18",196="MC33972_PIN_19",179="MC33972_PIN_2",197="MC33972_PIN_20",198="MC33972_PIN_21",199="MC33972_PIN_22",180="MC33972_PIN_3",181="MC33972_PIN_4",182="MC33972_PIN_5",183="MC33972_PIN_6",184="MC33972_PIN_7",185="MC33972_PIN_8",186="MC33972_PIN_9",345="MSIOBOX_0_OUT_1",346="MSIOBOX_0_OUT_2",347="MSIOBOX_0_OUT_3",348="MSIOBOX_0_OUT_4",349="MSIOBOX_0_OUT_5",350="MSIOBOX_0_OUT_6",351="MSIOBOX_0_OUT_7",352="MSIOBOX_0_OUT_8",357="MSIOBOX_0_SW_1",358="MSIOBOX_0_SW_2",359="MSIOBOX_0_SW_3",360="MSIOBOX_0_SW_4",353="MSIOBOX_0_VSS_1",354="MSIOBOX_0_VSS_2",355="MSIOBOX_0_VSS_3",356="MSIOBOX_0_VSS_4",289="PROTECTED_PIN_0",290="PROTECTED_PIN_1",299="PROTECTED_PIN_10",300="PROTECTED_PIN_11",301="PROTECTED_PIN_12",302="PROTECTED_PIN_13",303="PROTECTED_PIN_14",304="PROTECTED_PIN_15",291="PROTECTED_PIN_2",292="PROTECTED_PIN_3",293="PROTECTED_PIN_4",294="PROTECTED_PIN_5",295="PROTECTED_PIN_6",296="PROTECTED_PIN_7",297="PROTECTED_PIN_8",298="PROTECTED_PIN_9",231="TLE6240_PIN_1",240="TLE6240_PIN_10",241="TLE6240_PIN_11",242="TLE6240_PIN_12",243="TLE6240_PIN_13",244="TLE6240_PIN_14",245="TLE6240_PIN_15",246="TLE6240_PIN_16",232="TLE6240_PIN_2",233="TLE6240_PIN_3",234="TLE6240_PIN_4",235="TLE6240_PIN_5",236="TLE6240_PIN_6",237="TLE6240_PIN_7",238="TLE6240_PIN_8",239="TLE6240_PIN_9",200="TLE8888_PIN_1",209="TLE8888_PIN_10",210="TLE8888_PIN_11",211="TLE8888_PIN_12",212="TLE8888_PIN_13",213="TLE8888_PIN_14",214="TLE8888_PIN_15",215="TLE8888_PIN_16",216="TLE8888_PIN_17",217="TLE8888_PIN_18",218="TLE8888_PIN_19",201="TLE8888_PIN_2",219="TLE8888_PIN_20",220="TLE8888_PIN_21",221="TLE8888_PIN_22",222="TLE8888_PIN_23",223="TLE8888_PIN_24",224="TLE8888_PIN_25",225="TLE8888_PIN_26",226="TLE8888_PIN_27",227="TLE8888_PIN_28",202="TLE8888_PIN_3",203="TLE8888_PIN_4",204="TLE8888_PIN_5",205="TLE8888_PIN_6",206="TLE8888_PIN_7",207="TLE8888_PIN_8",208="TLE8888_PIN_9",229="TLE8888_PIN_KEY",228="TLE8888_PIN_MR",230="TLE8888_PIN_WAKE",321="TLE9104_0_OUT_0",322="TLE9104_0_OUT_1",323="TLE9104_0_OUT_2",324="TLE9104_0_OUT_3",325="TLE9104_1_OUT_0",326="TLE9104_1_OUT_1",327="TLE9104_1_OUT_2",328="TLE9104_1_OUT_3",329="TLE9104_2_OUT_0",330="TLE9104_2_OUT_1",331="TLE9104_2_OUT_2",332="TLE9104_2_OUT_3",333="TLE9104_3_OUT_0",334="TLE9104_3_OUT_1",335="TLE9104_3_OUT_2",336="TLE9104_3_OUT_3",337="TLE9104_4_OUT_0",338="TLE9104_4_OUT_1",339="TLE9104_4_OUT_2",340="TLE9104_4_OUT_3",341="TLE9104_5_OUT_0",342="TLE9104_5_OUT_1",343="TLE9104_5_OUT_2",344="TLE9104_5_OUT_3"
#define Gpio_B0 18
#define Gpio_B1 19
#define Gpio_B10 28
#define Gpio_B11 29
#define Gpio_B12 30
#define Gpio_B13 31
#define Gpio_B14 32
#define Gpio_B15 33
#define Gpio_B2 20
#define Gpio_B3 21
#define Gpio_B4 22
#define Gpio_B5 23
#define Gpio_B6 24
#define Gpio_B7 25
#define Gpio_B8 26
#define Gpio_B9 27
#define Gpio_C0 34
#define Gpio_C1 35
#define Gpio_C10 44
#define Gpio_C11 45
#define Gpio_C12 46
#define Gpio_C13 47
#define Gpio_C14 48
#define Gpio_C15 49
#define Gpio_C2 36
#define Gpio_C3 37
#define Gpio_C4 38
#define Gpio_C5 39
#define Gpio_C6 40
#define Gpio_C7 41
#define Gpio_C8 42
#define Gpio_C9 43
#define Gpio_CAN_PIN_0 281
#define Gpio_CAN_PIN_1 282
#define Gpio_CAN_PIN_2 283
#define Gpio_CAN_PIN_3 284
#define Gpio_CAN_PIN_4 285
#define Gpio_CAN_PIN_5 286
#define Gpio_CAN_PIN_6 287
#define Gpio_CAN_PIN_7 288
#define Gpio_D0 50
#define Gpio_D1 51
#define Gpio_D10 60
#define Gpio_D11 61
#define Gpio_D12 62
#define Gpio_D13 63
#define Gpio_D14 64
#define Gpio_D15 65
#define Gpio_D2 52
#define Gpio_D3 53
#define Gpio_D4 54
#define Gpio_D5 55
#define Gpio_D6 56
#define Gpio_D7 57
#define Gpio_D8 58
#define Gpio_D9 59
#define Gpio_E0 66
#define Gpio_E1 67
#define Gpio_E10 76
#define Gpio_E11 77
#define Gpio_E12 78
#define Gpio_E13 79
#define Gpio_E14 80
#define Gpio_E15 81
#define Gpio_E2 68
#define Gpio_E3 69
#define Gpio_E4 70
#define Gpio_E5 71
#define Gpio_E6 72
#define Gpio_E7 73
#define Gpio_E8 74
#define Gpio_E9 75
#define Gpio_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15", "PJ0", "PJ1", "PJ2", "PJ3", "PJ4", "PJ5", "PJ6", "PJ7", "PJ8", "PJ9", "PJ10", "PJ11", "PJ12", "PJ13", "PJ14", "PJ15", "PK0", "PK1", "PK2", "PK3", "PK4", "PK5", "PK6", "PK7", "PK8", "PK9", "PK10", "PK11", "PK12", "PK13", "PK14", "PK15"
#define Gpio_F0 82
#define Gpio_F1 83
#define Gpio_F10 92
#define Gpio_F11 93
#define Gpio_F12 94
#define Gpio_F13 95
#define Gpio_F14 96
#define Gpio_F15 97
#define Gpio_F2 84
#define Gpio_F3 85
#define Gpio_F4 86
#define Gpio_F5 87
#define Gpio_F6 88
#define Gpio_F7 89
#define Gpio_F8 90
#define Gpio_F9 91
#define Gpio_G0 98
#define Gpio_G1 99
#define Gpio_G10 108
#define Gpio_G11 109
#define Gpio_G12 110
#define Gpio_G13 111
#define Gpio_G14 112
#define Gpio_G15 113
#define Gpio_G2 100
#define Gpio_G3 101
#define Gpio_G4 102
#define Gpio_G5 103
#define Gpio_G6 104
#define Gpio_G7 105
#define Gpio_G8 106
#define Gpio_G9 107
#define Gpio_H0 114
#define Gpio_H1 115
#define Gpio_H10 124
#define Gpio_H11 125
#define Gpio_H12 126
#define Gpio_H13 127
#define Gpio_H14 128
#define Gpio_H15 129
#define Gpio_H2 116
#define Gpio_H3 117
#define Gpio_H4 118
#define Gpio_H5 119
#define Gpio_H6 120
#define Gpio_H7 121
#define Gpio_H8 122
#define Gpio_H9 123
#define Gpio_HBRIDGE_1_OUT 361
#define Gpio_HBRIDGE_2_OUT 362
#define Gpio_I0 130
#define Gpio_I1 131
#define Gpio_I10 140
#define Gpio_I11 141
#define Gpio_I12 142
#define Gpio_I13 143
#define Gpio_I14 144
#define Gpio_I15 145
#define Gpio_I2 132
#define Gpio_I3 133
#define Gpio_I4 134
#define Gpio_I5 135
#define Gpio_I6 136
#define Gpio_I7 137
#define Gpio_I8 138
#define Gpio_I9 139
#define Gpio_Invalid 1
#define Gpio_J0 146
#define Gpio_J1 147
#define Gpio_J10 156
#define Gpio_J11 157
#define Gpio_J12 158
#define Gpio_J13 159
#define Gpio_J14 160
#define Gpio_J15 161
#define Gpio_J2 148
#define Gpio_J3 149
#define Gpio_J4 150
#define Gpio_J5 151
#define Gpio_J6 152
#define Gpio_J7 153
#define Gpio_J8 154
#define Gpio_J9 155
#define Gpio_K0 162
#define Gpio_K1 163
#define Gpio_K10 172
#define Gpio_K11 173
#define Gpio_K12 174
#define Gpio_K13 175
#define Gpio_K14 176
#define Gpio_K15 177
#define Gpio_K2 164
#define Gpio_K3 165
#define Gpio_K4 166
#define Gpio_K5 167
#define Gpio_K6 168
#define Gpio_K7 169
#define Gpio_K8 170
#define Gpio_K9 171
#define Gpio_L9779_IGN_1 247
#define Gpio_L9779_IGN_2 248
#define Gpio_L9779_IGN_3 249
#define Gpio_L9779_IGN_4 250
#define Gpio_L9779_OUT_1 251
#define Gpio_L9779_OUT_10 260
#define Gpio_L9779_OUT_11 261
#define Gpio_L9779_OUT_12 262
#define Gpio_L9779_OUT_13 263
#define Gpio_L9779_OUT_14 264
#define Gpio_L9779_OUT_15 265
#define Gpio_L9779_OUT_16 266
#define Gpio_L9779_OUT_17 267
#define Gpio_L9779_OUT_18 268
#define Gpio_L9779_OUT_19 269
#define Gpio_L9779_OUT_2 252
#define Gpio_L9779_OUT_20 270
#define Gpio_L9779_OUT_25 275
#define Gpio_L9779_OUT_26 276
#define Gpio_L9779_OUT_27 277
#define Gpio_L9779_OUT_28 278
#define Gpio_L9779_OUT_3 253
#define Gpio_L9779_OUT_4 254
#define Gpio_L9779_OUT_5 255
#define Gpio_L9779_OUT_6 256
#define Gpio_L9779_OUT_7 257
#define Gpio_L9779_OUT_8 258
#define Gpio_L9779_OUT_9 259
#define Gpio_L9779_OUT_A 271
#define Gpio_L9779_OUT_B 272
#define Gpio_L9779_OUT_C 273
#define Gpio_L9779_OUT_D 274
#define Gpio_L9779_OUT_MRD 279
#define Gpio_L9779_PIN_KEY 280
#define Gpio_MC33810_0_GD_0 309
#define Gpio_MC33810_0_GD_1 310
#define Gpio_MC33810_0_GD_2 311
#define Gpio_MC33810_0_GD_3 312
#define Gpio_MC33810_0_OUT_0 305
#define Gpio_MC33810_0_OUT_1 306
#define Gpio_MC33810_0_OUT_2 307
#define Gpio_MC33810_0_OUT_3 308
#define Gpio_MC33810_1_GD_0 317
#define Gpio_MC33810_1_GD_1 318
#define Gpio_MC33810_1_GD_2 319
#define Gpio_MC33810_1_GD_3 320
#define Gpio_MC33810_1_OUT_0 313
#define Gpio_MC33810_1_OUT_1 314
#define Gpio_MC33810_1_OUT_2 315
#define Gpio_MC33810_1_OUT_3 316
#define Gpio_MC33972_PIN_1 178
#define Gpio_MC33972_PIN_10 187
#define Gpio_MC33972_PIN_11 188
#define Gpio_MC33972_PIN_12 189
#define Gpio_MC33972_PIN_13 190
#define Gpio_MC33972_PIN_14 191
#define Gpio_MC33972_PIN_15 192
#define Gpio_MC33972_PIN_16 193
#define Gpio_MC33972_PIN_17 194
#define Gpio_MC33972_PIN_18 195
#define Gpio_MC33972_PIN_19 196
#define Gpio_MC33972_PIN_2 179
#define Gpio_MC33972_PIN_20 197
#define Gpio_MC33972_PIN_21 198
#define Gpio_MC33972_PIN_22 199
#define Gpio_MC33972_PIN_3 180
#define Gpio_MC33972_PIN_4 181
#define Gpio_MC33972_PIN_5 182
#define Gpio_MC33972_PIN_6 183
#define Gpio_MC33972_PIN_7 184
#define Gpio_MC33972_PIN_8 185
#define Gpio_MC33972_PIN_9 186
#define Gpio_MSIOBOX_0_OUT_1 345
#define Gpio_MSIOBOX_0_OUT_2 346
#define Gpio_MSIOBOX_0_OUT_3 347
#define Gpio_MSIOBOX_0_OUT_4 348
#define Gpio_MSIOBOX_0_OUT_5 349
#define Gpio_MSIOBOX_0_OUT_6 350
#define Gpio_MSIOBOX_0_OUT_7 351
#define Gpio_MSIOBOX_0_OUT_8 352
#define Gpio_MSIOBOX_0_SW_1 357
#define Gpio_MSIOBOX_0_SW_2 358
#define Gpio_MSIOBOX_0_SW_3 359
#define Gpio_MSIOBOX_0_SW_4 360
#define Gpio_MSIOBOX_0_VSS_1 353
#define Gpio_MSIOBOX_0_VSS_2 354
#define Gpio_MSIOBOX_0_VSS_3 355
#define Gpio_MSIOBOX_0_VSS_4 356
#define Gpio_PROTECTED_PIN_0 289
#define Gpio_PROTECTED_PIN_1 290
#define Gpio_PROTECTED_PIN_10 299
#define Gpio_PROTECTED_PIN_11 300
#define Gpio_PROTECTED_PIN_12 301
#define Gpio_PROTECTED_PIN_13 302
#define Gpio_PROTECTED_PIN_14 303
#define Gpio_PROTECTED_PIN_15 304
#define Gpio_PROTECTED_PIN_2 291
#define Gpio_PROTECTED_PIN_3 292
#define Gpio_PROTECTED_PIN_4 293
#define Gpio_PROTECTED_PIN_5 294
#define Gpio_PROTECTED_PIN_6 295
#define Gpio_PROTECTED_PIN_7 296
#define Gpio_PROTECTED_PIN_8 297
#define Gpio_PROTECTED_PIN_9 298
#define Gpio_TLE6240_PIN_1 231
#define Gpio_TLE6240_PIN_10 240
#define Gpio_TLE6240_PIN_11 241
#define Gpio_TLE6240_PIN_12 242
#define Gpio_TLE6240_PIN_13 243
#define Gpio_TLE6240_PIN_14 244
#define Gpio_TLE6240_PIN_15 245
#define Gpio_TLE6240_PIN_16 246
#define Gpio_TLE6240_PIN_2 232
#define Gpio_TLE6240_PIN_3 233
#define Gpio_TLE6240_PIN_4 234
#define Gpio_TLE6240_PIN_5 235
#define Gpio_TLE6240_PIN_6 236
#define Gpio_TLE6240_PIN_7 237
#define Gpio_TLE6240_PIN_8 238
#define Gpio_TLE6240_PIN_9 239
#define Gpio_TLE8888_PIN_1 200
#define Gpio_TLE8888_PIN_10 209
#define Gpio_TLE8888_PIN_11 210
#define Gpio_TLE8888_PIN_12 211
#define Gpio_TLE8888_PIN_13 212
#define Gpio_TLE8888_PIN_14 213
#define Gpio_TLE8888_PIN_15 214
#define Gpio_TLE8888_PIN_16 215
#define Gpio_TLE8888_PIN_17 216
#define Gpio_TLE8888_PIN_18 217
#define Gpio_TLE8888_PIN_19 218
#define Gpio_TLE8888_PIN_2 201
#define Gpio_TLE8888_PIN_20 219
#define Gpio_TLE8888_PIN_21 220
#define Gpio_TLE8888_PIN_22 221
#define Gpio_TLE8888_PIN_23 222
#define Gpio_TLE8888_PIN_24 223
#define Gpio_TLE8888_PIN_25 224
#define Gpio_TLE8888_PIN_26 225
#define Gpio_TLE8888_PIN_27 226
#define Gpio_TLE8888_PIN_28 227
#define Gpio_TLE8888_PIN_3 202
#define Gpio_TLE8888_PIN_4 203
#define Gpio_TLE8888_PIN_5 204
#define Gpio_TLE8888_PIN_6 205
#define Gpio_TLE8888_PIN_7 206
#define Gpio_TLE8888_PIN_8 207
#define Gpio_TLE8888_PIN_9 208
#define Gpio_TLE8888_PIN_KEY 229
#define Gpio_TLE8888_PIN_MR 228
#define Gpio_TLE8888_PIN_WAKE 230
#define Gpio_TLE9104_0_OUT_0 321
#define Gpio_TLE9104_0_OUT_1 322
#define Gpio_TLE9104_0_OUT_2 323
#define Gpio_TLE9104_0_OUT_3 324
#define Gpio_TLE9104_1_OUT_0 325
#define Gpio_TLE9104_1_OUT_1 326
#define Gpio_TLE9104_1_OUT_2 327
#define Gpio_TLE9104_1_OUT_3 328
#define Gpio_TLE9104_2_OUT_0 329
#define Gpio_TLE9104_2_OUT_1 330
#define Gpio_TLE9104_2_OUT_2 331
#define Gpio_TLE9104_2_OUT_3 332
#define Gpio_TLE9104_3_OUT_0 333
#define Gpio_TLE9104_3_OUT_1 334
#define Gpio_TLE9104_3_OUT_2 335
#define Gpio_TLE9104_3_OUT_3 336
#define Gpio_TLE9104_4_OUT_0 337
#define Gpio_TLE9104_4_OUT_1 338
#define Gpio_TLE9104_4_OUT_2 339
#define Gpio_TLE9104_4_OUT_3 340
#define Gpio_TLE9104_5_OUT_0 341
#define Gpio_TLE9104_5_OUT_1 342
#define Gpio_TLE9104_5_OUT_2 343
#define Gpio_TLE9104_5_OUT_3 344
#define Gpio_Unassigned 0
#define GPPWM_1_NAME "General Purpose PWM 1"
#define GPPWM_2_NAME "General Purpose PWM 2"
#define GPPWM_3_NAME "General Purpose PWM 3"
#define GPPWM_4_NAME "General Purpose PWM 4"
#define gppwm_channel_e_auto_enum 0="GPPWM_Zero",9="GPPWM_AccelPedal",16="GPPWM_AuxLinear1",17="GPPWM_AuxLinear2",29="GPPWM_AuxLinear3",30="GPPWM_AuxLinear4",7="GPPWM_AuxTemp1",8="GPPWM_AuxTemp2",26="GPPWM_BaroPressure",3="GPPWM_Clt",25="GPPWM_DetectedGear",27="GPPWM_Egt1",28="GPPWM_Egt2",15="GPPWM_EthanolPercent",5="GPPWM_FuelLoad",34="GPPWM_FuelPressure",18="GPPWM_GppwmOutput1",19="GPPWM_GppwmOutput2",20="GPPWM_GppwmOutput3",21="GPPWM_GppwmOutput4",4="GPPWM_Iat",6="GPPWM_IgnLoad",22="GPPWM_LuaGauge1",23="GPPWM_LuaGauge2",2="GPPWM_Map",32="GPPWM_OilPressure",33="GPPWM_OilTemp",24="GPPWM_Rpm",35="GPPWM_ThrottleRatio",1="GPPWM_Tps",12="GPPWM_VVT_1E",11="GPPWM_VVT_1I",14="GPPWM_VVT_2E",13="GPPWM_VVT_2I",10="GPPWM_Vbatt",31="GPPWM_VehicleSpeed"
#define gppwm_channel_e_GPPWM_AccelPedal 9
#define gppwm_channel_e_GPPWM_AuxLinear1 16
#define gppwm_channel_e_GPPWM_AuxLinear2 17
#define gppwm_channel_e_GPPWM_AuxLinear3 29
#define gppwm_channel_e_GPPWM_AuxLinear4 30
#define gppwm_channel_e_GPPWM_AuxTemp1 7
#define gppwm_channel_e_GPPWM_AuxTemp2 8
#define gppwm_channel_e_GPPWM_BaroPressure 26
#define gppwm_channel_e_GPPWM_Clt 3
#define gppwm_channel_e_GPPWM_DetectedGear 25
#define gppwm_channel_e_GPPWM_Egt1 27
#define gppwm_channel_e_GPPWM_Egt2 28
#define gppwm_channel_e_GPPWM_EthanolPercent 15
#define gppwm_channel_e_GPPWM_FuelLoad 5
#define gppwm_channel_e_GPPWM_FuelPressure 34
#define gppwm_channel_e_GPPWM_GppwmOutput1 18
#define gppwm_channel_e_GPPWM_GppwmOutput2 19
#define gppwm_channel_e_GPPWM_GppwmOutput3 20
#define gppwm_channel_e_GPPWM_GppwmOutput4 21
#define gppwm_channel_e_GPPWM_Iat 4
#define gppwm_channel_e_GPPWM_IgnLoad 6
#define gppwm_channel_e_GPPWM_LuaGauge1 22
#define gppwm_channel_e_GPPWM_LuaGauge2 23
#define gppwm_channel_e_GPPWM_Map 2
#define gppwm_channel_e_GPPWM_OilPressure 32
#define gppwm_channel_e_GPPWM_OilTemp 33
#define gppwm_channel_e_GPPWM_Rpm 24
#define gppwm_channel_e_GPPWM_ThrottleRatio 35
#define gppwm_channel_e_GPPWM_Tps 1
#define gppwm_channel_e_GPPWM_Vbatt 10
#define gppwm_channel_e_GPPWM_VehicleSpeed 31
#define gppwm_channel_e_GPPWM_VVT_1E 12
#define gppwm_channel_e_GPPWM_VVT_1I 11
#define gppwm_channel_e_GPPWM_VVT_2E 14
#define gppwm_channel_e_GPPWM_VVT_2I 13
#define gppwm_channel_e_GPPWM_Zero 0
#define gppwm_channel_size 108
#define GPPWM_CHANNELS 4
#define gppwm_compare_mode_e_GPPWM_GreaterThan 0
#define gppwm_compare_mode_e_GPPWM_LessThan 1
#define GPPWM_LOAD_COUNT 8
#define GPPWM_NOTE_SIZE 16
#define GPPWM_RPM_COUNT 8
#define HD_MENU_NAME "Harley"
#define hpfp_cam_e_auto_enum 0="HPFP_CAM_NONE",2="HPFP_CAM_EX1",4="HPFP_CAM_EX2",1="HPFP_CAM_IN1",3="HPFP_CAM_IN2"
#define hpfp_cam_e_enum "NONE", "Intake 1", "Exhaust 1", "Intake 2", "Exhaust 2"
#define hpfp_cam_e_HPFP_CAM_EX1 2
#define hpfp_cam_e_HPFP_CAM_EX2 4
#define hpfp_cam_e_HPFP_CAM_IN1 1
#define hpfp_cam_e_HPFP_CAM_IN2 3
#define hpfp_cam_e_HPFP_CAM_NONE 0
#define HPFP_COMPENSATION_RPM_SIZE 10
#define HPFP_COMPENSATION_SIZE 10
#define HPFP_DEADTIME_SIZE 8
#define HPFP_FUEL_MASS_COMPENSATION_SIZE 8
#define HPFP_LOBE_PROFILE_SIZE 16
#define HPFP_TARGET_SIZE 10
#define HW_EVENT_TYPES 4
#define i2c_bus_e_I2C_BUS_1 1
#define i2c_bus_e_I2C_BUS_2 2
#define i2c_bus_e_I2C_BUS_3 3
#define i2c_bus_e_I2C_BUS_4 4
#define i2c_bus_e_I2C_NONE 0
#define I2C_BUS_TOTAL_COUNT 4
#define i2c_config_s_size 12
#define i2c_speed_e_auto_enum 0="I2C_SPEED_100K",2="I2C_SPEED_1M",3="I2C_SPEED_3p4M",1="I2C_SPEED_400K",4="I2C_SPEED_5M"
#define i2c_speed_e_I2C_SPEED_100K 0
#define i2c_speed_e_I2C_SPEED_1M 2
#define i2c_speed_e_I2C_SPEED_3p4M 3
#define i2c_speed_e_I2C_SPEED_400K 1
#define i2c_speed_e_I2C_SPEED_5M 4
#define IAC_PID_MULT_RPM_SIZE 8
#define IAC_PID_MULT_SIZE 8
#define IAT_CURVE_SIZE 16
#define IAT_IGN_CORR_LOAD_COUNT 8
#define IAT_IGN_CORR_TEMP_COUNT 8
#define IDLE_ADVANCE_CURVE_SIZE 8
#define idle_hardware_s_size 12
#define idle_mode_e_auto_enum 0="IM_AUTO",1="IM_MANUAL"
#define idle_mode_e_IM_AUTO 0
#define idle_mode_e_IM_MANUAL 1
#define idle_state_e_BLIP 64
#define idle_state_e_INIT 0
#define idle_state_e_PID_UPPER 16
#define idle_state_e_PID_VALUE 4
#define idle_state_e_RPM_DEAD_ZONE 2
#define idle_state_e_TPS_THRESHOLD 1
#define IDLE_VE_SIZE 4
#define IDLE_VE_SIZE_RPM 4
#define IGN_BLEND_COUNT 4
#define ign_cyl_trim_s_size 16
#define IGN_LOAD_COUNT 16
#define IGN_RPM_COUNT 16
#define IGN_TRIM_1_NAME "Ignition trim cyl 1"
#define IGN_TRIM_2_NAME "Ignition trim cyl 2"
#define IGN_TRIM_SIZE 4
#define IGNITION_ADVANCE_MENU_NAME "Ignition advance"
#define IGNITION_ADVANCE_TABLE_NAME "Ignition Table"
#define ignition_mode_e_auto_enum 0="IM_ONE_COIL",1="IM_INDIVIDUAL_COILS",3="IM_TWO_COILS",2="IM_WASTED_SPARK"
#define ignition_mode_e_IM_INDIVIDUAL_COILS 1
#define ignition_mode_e_IM_ONE_COIL 0
#define ignition_mode_e_IM_TWO_COILS 3
#define ignition_mode_e_IM_WASTED_SPARK 2
#define IGNITION_OUTPUT "Ignition Cylinder"
#define imu_type_e_auto_enum 0="IMU_NONE",2="IMU_MM5_10",3="IMU_TYPE_3",4="IMU_TYPE_4",5="IMU_TYPE_MB_A0065422618",1="IMU_VAG"
#define imu_type_e_IMU_MM5_10 2
#define imu_type_e_IMU_NONE 0
#define imu_type_e_IMU_TYPE_3 3
#define imu_type_e_IMU_TYPE_4 4
#define imu_type_e_IMU_TYPE_MB_A0065422618 5
#define imu_type_e_IMU_VAG 1
#define INDICATOR_NAME_AC_SWITCH "AC switch"
#define INDICATOR_NAME_BRAKE_DOWN "Brake switch"
#define INDICATOR_NAME_CLUTCH_DOWN "Clutch: down"
#define INDICATOR_NAME_CLUTCH_UP "Clutch: up"
#define INJ_PHASE_LOAD_COUNT 16
#define INJ_PHASE_RPM_COUNT 16
#define INJ_STAGING_COUNT 6
#define INJ_STAGING_RPM_SIZE 6
#define injection_mode_e_auto_enum 0="IM_SIMULTANEOUS",2="IM_BATCH",1="IM_SEQUENTIAL",3="IM_SINGLE_POINT"
#define injection_mode_e_enum "Simultaneous", "Sequential", "Batch", "Single Point"
#define injection_mode_e_IM_BATCH 2
#define injection_mode_e_IM_SEQUENTIAL 1
#define injection_mode_e_IM_SIMULTANEOUS 0
#define injection_mode_e_IM_SINGLE_POINT 3
#define InjectionTimingMode_auto_enum 0="End",2="Center",1="Start"
#define InjectionTimingMode_Center 2
#define InjectionTimingMode_End 0
#define InjectionTimingMode_Start 1
#define INJECTOR_1_NAME "Injector #1"
#define INJECTOR_2_NAME "Injector #2"
#define injector_compensation_mode_e_auto_enum 0="ICM_None",1="ICM_FixedRailPressure",3="ICM_HPFP_Manual_Compensation",2="ICM_SensedRailPressure"
#define injector_compensation_mode_e_ICM_FixedRailPressure 1
#define injector_compensation_mode_e_ICM_HPFP_Manual_Compensation 3
#define injector_compensation_mode_e_ICM_None 0
#define injector_compensation_mode_e_ICM_SensedRailPressure 2
#define injector_pressure_type_e_auto_enum 0="IPT_Low",1="IPT_High"
#define injector_pressure_type_e_IPT_High 1
#define injector_pressure_type_e_IPT_Low 0
#define injector_s_size 60
#define InjectorNonlinearMode_auto_enum 0="INJ_None",2="INJ_FordModel",1="INJ_PolynomialAdder"
#define InjectorNonlinearMode_INJ_FordModel 2
#define InjectorNonlinearMode_INJ_None 0
#define InjectorNonlinearMode_INJ_PolynomialAdder 1
#define INSTANCE_INJECTOR injector
#define JUMP_DFU_COMMAND 0xBA
#define KNOCK_RPM_TABLE_NAME "Engine Knock Threshold RPM Based"
#define KNOCK_TABLE_RPM_SIZE 6
#define KNOCK_TABLE_SIZE 6
#define KnockGain_size 36
#define LAM_RPM_SIZE 4
#define LAM_SIZE 4
#define launchActivationMode_e_ALWAYS_ACTIVE_LAUNCH 2
#define launchActivationMode_e_auto_enum 0="SWITCH_INPUT_LAUNCH",2="ALWAYS_ACTIVE_LAUNCH",1="CLUTCH_INPUT_LAUNCH",4="LUA_LAUNCH",3="STOP_INPUT_LAUNCH"
#define launchActivationMode_e_CLUTCH_INPUT_LAUNCH 1
#define launchActivationMode_e_enum "Launch Button", "Clutch Down Switch", "Speed Based", "Brake Pedal", "Lua"
#define launchActivationMode_e_LUA_LAUNCH 4
#define launchActivationMode_e_STOP_INPUT_LAUNCH 3
#define launchActivationMode_e_SWITCH_INPUT_LAUNCH 0
#define linear_sensor_s_size 20
#define load_override_e_AFR_AccPedal 3
#define load_override_e_AFR_CylFilling 4
#define load_override_e_AFR_MAP 1
#define load_override_e_AFR_None 0
#define load_override_e_AFR_Tps 2
#define load_override_e_auto_enum 0="AFR_None",3="AFR_AccPedal",4="AFR_CylFilling",1="AFR_MAP",2="AFR_Tps"
