Antonecu/fw-custom-example/generated/controllers/generated/rusefi_generated_mega_stm32f4xx.h
#define load_override_e_enum "None", "MAP", "TPS", "Acc Pedal", "Cyl Filling %"
#define LOG_DELIMITER "`"
#define LOGIC_ANALYZER_CHANNEL_COUNT 4
#define LTFT_PAGE_ENABLED true
#define ltft_s_size 16
#define LUA_ANALOG_INPUT_COUNT 8
#define LUA_BUTTON_COUNT 10
#define LUA_DIGITAL_INPUT_COUNT 8
#define LUA_GAUGE_COUNT 8
#define lua_gauge_e_auto_enum 0="LUA_GAUGE_1",1="LUA_GAUGE_2",2="LUA_GAUGE_3",3="LUA_GAUGE_4",4="LUA_GAUGE_5",5="LUA_GAUGE_6",6="LUA_GAUGE_7",7="LUA_GAUGE_8"
#define lua_gauge_e_enum "Lua Gauge 1", "Lua Gauge 2", "Lua Gauge 3", "Lua Gauge 4", "Lua Gauge 5", "Lua Gauge 6", "Lua Gauge 7", "Lua Gauge 8"
#define lua_gauge_e_LUA_GAUGE_1 0
#define lua_gauge_e_LUA_GAUGE_2 1
#define lua_gauge_e_LUA_GAUGE_3 2
#define lua_gauge_e_LUA_GAUGE_4 3
#define lua_gauge_e_LUA_GAUGE_5 4
#define lua_gauge_e_LUA_GAUGE_6 5
#define lua_gauge_e_LUA_GAUGE_7 6
#define lua_gauge_e_LUA_GAUGE_8 7
#define lua_gauge_meaning_e_auto_enum 0="LUA_GAUGE_LOWER_BOUND",1="LUA_GAUGE_UPPER_BOUND"
#define lua_gauge_meaning_e_enum "greater than", "less than"
#define lua_gauge_meaning_e_LUA_GAUGE_LOWER_BOUND 0
#define lua_gauge_meaning_e_LUA_GAUGE_UPPER_BOUND 1
#define LUA_PWM_COUNT 8
#define LUA_SCRIPT_SIZE 8000
#define MAF_DECODING_COUNT 32
#define MAIN_HELP_URL "http://www.rusefi.com/"
#define MAIN_PAGE_GAUGES_FILE "tunerstudio/main_page_gauges.ini"
#define MAP_ANGLE_SIZE 8
#define MAP_EST_LOAD_COUNT 16
#define MAP_EST_RPM_COUNT 16
#define MAP_sensor_config_s_size 140
#define MAP_UPPER_LIMIT 650
#define MAP_WINDOW_SIZE 8
#define MAX_CYLINDER_COUNT 12
#define MAX_TPS_PPS_DISCREPANCY 5
#define mc33810maxDwellTimer_e_auto_enum 0="DWELL_2MS",3="DWELL_16MS",4="DWELL_32MS",1="DWELL_4MS",5="DWELL_64MS",2="DWELL_8MS"
#define mc33810maxDwellTimer_e_DWELL_16MS 3
#define mc33810maxDwellTimer_e_DWELL_2MS 0
#define mc33810maxDwellTimer_e_DWELL_32MS 4
#define mc33810maxDwellTimer_e_DWELL_4MS 1
#define mc33810maxDwellTimer_e_DWELL_64MS 5
#define mc33810maxDwellTimer_e_DWELL_8MS 2
#define MEMBER_FLOW flow
#define MENU_NAME_AUX_TEMP1 "AuxTemp1 sensor"
#define MENU_NAME_AUX_TEMP2 "AuxTemp2 sensor"
#define MIN_launchTpsThreshold 3
#define MLQ_FIELD_HEADER_SIZE 89
#define MLQ_HEADER_SIZE 24
#define MsIoBox_config_s_size 4
#define MsIoBoxId_auto_enum 0="OFF",1="ID200",2="ID220",3="ID240"
#define MsIoBoxId_enum "Off", "ID1 (0x200)", "ID2 (0x220)", "ID3 (0x240)"
#define MsIoBoxId_ID200 1
#define MsIoBoxId_ID220 2
#define MsIoBoxId_ID240 3
#define MsIoBoxId_OFF 0
#define MsIoBoxVss_ALL1234 3
#define MsIoBoxVss_auto_enum 0="OFF",3="ALL1234",2="HALL34",1="VR12"
#define MsIoBoxVss_enum "Off", "VR speed in (1, 2)", "Hall speed in (3, 4)", "All (1, 2, 3, 4)"
#define MsIoBoxVss_HALL34 2
#define MsIoBoxVss_OFF 0
#define MsIoBoxVss_VR12 1
#define nitrous_arming_method_e_auto_enum 0="DIGITAL_SWITCH_INPUT",1="LUA_GAUGE"
#define nitrous_arming_method_e_DIGITAL_SWITCH_INPUT 0
#define nitrous_arming_method_e_enum "Digital Switch Input", "Lua Gauge"
#define nitrous_arming_method_e_LUA_GAUGE 1
#define operation_mode_e_FOUR_STROKE_CAM_SENSOR 2
#define operation_mode_e_FOUR_STROKE_CRANK_SENSOR 1
#define operation_mode_e_FOUR_STROKE_FIVE_TIMES_CRANK_SENSOR 8
#define operation_mode_e_FOUR_STROKE_SIX_TIMES_CRANK_SENSOR 7
#define operation_mode_e_FOUR_STROKE_SYMMETRICAL_CRANK_SENSOR 4
#define operation_mode_e_FOUR_STROKE_THREE_TIMES_CRANK_SENSOR 5
#define operation_mode_e_FOUR_STROKE_TWELVE_TIMES_CRANK_SENSOR 6
#define operation_mode_e_OM_NONE 0
#define operation_mode_e_TWO_STROKE 3
#define OUTPUT_CHANNEL_SD_LOGGING_INTERNAL "sd_logging_internal"
#define OUTPUT_CHANNEL_SD_MSD "sd_msd"
#define OUTPUT_CHANNEL_SD_PRESENT "sd_present"
#define output_pin_e_enum 0="NONE",47="AC RELAY (PC13)",50="CAN 1 RX (D0)",51="CAN 1 TX (D1)",40="CHECK (PC6)",10="CLT GAUGE (PA8)",61="D12 (PD11)",60="D13 (PD10)",33="D23 (SPI2 MOSI B15)",32="D25 (SPI2 MISO B14)",54="D26 (PD4)",30="D27 (SPI2 CS B12)",21="D28 (PB3)",31="D29 (SPI2 SCK B13)",57="D30 (PD7)",42="EVAP (PC8)",72="FAN (PE6)",69="FAN2 (PE3)",41="IDLE (PC7)",75="IGN1 (PE9)",77="IGN2 (PE11)",79="IGN3  (PE13)",80="IGN4 (PE14)",62="INJ1 (PD12)",63="INJ2 (PD13)",64="INJ3 (PD14)",65="INJ4 (PD15)",71="LED (PE5)",58="MAIN (PD8)",59="O2 HEATER (PD9)",43="OUT48L (PC9)",66="PUMP (PE0)",56="RX3 (PD6)",73="TACHO (PE7)",55="TX3 (PD5)"
#define output_pin_e_fullenum "NONE","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","CLT GAUGE (PA8)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","D28 (PB3)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","D27 (SPI2 CS B12)","D29 (SPI2 SCK B13)","D25 (SPI2 MISO B14)","D23 (SPI2 MOSI B15)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","CHECK (PC6)","IDLE (PC7)","EVAP (PC8)","OUT48L (PC9)","INVALID","INVALID","INVALID","AC RELAY (PC13)","INVALID","INVALID","CAN 1 RX (D0)","CAN 1 TX (D1)","INVALID","INVALID","D26 (PD4)","TX3 (PD5)","RX3 (PD6)","D30 (PD7)","MAIN (PD8)","O2 HEATER (PD9)","D13 (PD10)","D12 (PD11)","INJ1 (PD12)","INJ2 (PD13)","INJ3 (PD14)","INJ4 (PD15)","PUMP (PE0)","INVALID","INVALID","FAN2 (PE3)","INVALID","LED (PE5)","FAN (PE6)","TACHO (PE7)","INVALID","IGN1 (PE9)","INVALID","IGN2 (PE11)","INVALID","IGN3  (PE13)","IGN4 (PE14)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID"
#define PACK_ADD_TEMPERATURE 40
#define PACK_MULT_AFR 1000
#define PACK_MULT_AFR_CFG 10
#define PACK_MULT_ANGLE 50
#define PACK_MULT_EGTEMPERATURE 4
#define PACK_MULT_FLEX 2
#define PACK_MULT_FUEL_FLOW 200
#define PACK_MULT_FUEL_MASS 100
#define PACK_MULT_HIGH_PRESSURE 10
#define PACK_MULT_LAMBDA 10000
#define PACK_MULT_LAMBDA_CFG 147
#define PACK_MULT_MASS_FLOW 10
#define PACK_MULT_MS 300
#define PACK_MULT_PERCENT 100
#define PACK_MULT_PRESSURE 30
#define PACK_MULT_RAW_VOLTAGE 0.005
#define PACK_MULT_TEMPERATURE 100
#define PACK_MULT_VOLTAGE 1000
#define PACK_MULT_VSS 100
#define PACK_PERCENT_BYTE_MULT 100.0
#define PAGE_SIZE_2 256
#define PAGE_SIZE_3 2048
#define PAGE_SIZE_4 1268
#define PAGE_SIZE_5 8000
#define PEDAL_TO_TPS_RPM_SIZE 8
#define PEDAL_TO_TPS_SIZE 8
#define pedalSensor_NAME "Accelerator pedal"
#define pedalToTpsTbl_NAME "ETB pedal target"
#define PERCENT_TRIM_BYTE_PACKING_DIV 0.02
#define persistent_config_s_size 16760
#define pid_s_size 20
#define pin_input_mode_e_auto_enum 0="PI_DEFAULT",4="PI_INVERTED_DEFAULT",6="PI_INVERTED_PULLDOWN",5="PI_INVERTED_PULLUP",2="PI_PULLDOWN",1="PI_PULLUP"
#define pin_input_mode_e_PI_DEFAULT 0
#define pin_input_mode_e_PI_INVERTED_DEFAULT 4
#define pin_input_mode_e_PI_INVERTED_PULLDOWN 6
#define pin_input_mode_e_PI_INVERTED_PULLUP 5
#define pin_input_mode_e_PI_PULLDOWN 2
#define pin_input_mode_e_PI_PULLUP 1
#define pin_output_mode_e_auto_enum 0="OM_DEFAULT",1="OM_INVERTED",2="OM_OPENDRAIN",3="OM_OPENDRAIN_INVERTED"
#define pin_output_mode_e_OM_DEFAULT 0
#define pin_output_mode_e_OM_INVERTED 1
#define pin_output_mode_e_OM_OPENDRAIN 2
#define pin_output_mode_e_OM_OPENDRAIN_INVERTED 3
#define poke false
#define PPS_FAIL_INDICATOR "Pedal error"
#define PPS_OK_INDICATOR "Pedal OK"
#define ppsExpAverageAlpha_NAME "Accelerator Exp Average"
#define PRIMARY_CAN_NAME "Primary CAN"
#define PRIME_CURVE_COUNT 8
#define PRIME_FLEX_SIZE 4
#define PROTOCOL_COIL_SHORT_PREFIX "c"
#define PROTOCOL_CRANK1 "t1"
#define PROTOCOL_CRANK2 "t2"
#define PROTOCOL_ENGINE_SNIFFER "wave_chart"
#define PROTOCOL_ES_DOWN "d"
#define PROTOCOL_ES_UP "u"
#define PROTOCOL_HELLO_PREFIX "***"
#define PROTOCOL_INJ_SHORT_PREFIX "i"
#define PROTOCOL_INJ_STAGE2_SHORT_PREFIX "j"
#define PROTOCOL_MSG "msg"
#define PROTOCOL_OUTPIN "outpin"
#define PROTOCOL_SIGNATURE_PREFIX "rusEFI "
#define PROTOCOL_TEST_RESPONSE_TAG "ts_p_alive"
#define PROTOCOL_VERSION_TAG "rusEfiVersion"
#define RANGE_INPUT_COUNT 6
#define RE_auto_update_root_url "https://rusefi.com/build_server"
#define RE_obfuscated "false"
#define REBOOT_COMMAND 0xBB
#define rotational_idle_accumulator_s_size 4
#define rotational_idle_s_size 36
#define RotationalCutMode_auto_enum 0="Spark",2="Both",1="Fuel"
#define RotationalCutMode_Both 2
#define RotationalCutMode_e_enum "Spark", "Fuel", "Both"
#define RotationalCutMode_Fuel 1
#define RotationalCutMode_Spark 0
#define RPM_AS_BYTE_LIMIT 25000
#define RPM_AS_BYTE_SCALE 100
#define SCRIPT_CURVE_16 16
#define SCRIPT_CURVE_8 8
#define SCRIPT_CURVE_COUNT 6
#define SCRIPT_SETTING_COUNT 8
#define SCRIPT_TABLE_8 8
#define SCRIPT_TABLE_COUNT 4
#define scriptCurve3_NAME "Script Curve #3"
#define scriptCurve3_X_LINES 10
#define scriptCurve3_X_NAME "X"
#define scriptCurve3_X_RANGE 128
#define scriptCurve4_NAME "Script Curve #4"
#define scriptCurve4_X_LINES 10
#define scriptCurve4_X_NAME "X"
#define scriptCurve4_X_RANGE 128
#define SD_CARD_LABEL "rusEFI logs"
#define sd_log_state_e_SD_LOG_ACTIVE 4
#define sd_log_state_e_SD_LOG_BUTTON_OFF 8
#define sd_log_state_e_SD_LOG_DISABLED 0
#define sd_log_state_e_SD_LOG_FAILED 2
#define sd_log_state_e_SD_LOG_STOP_DELAY 5
#define sd_log_state_e_SD_LOG_SUPPRESSED 1
#define sd_log_state_e_SD_LOG_UNCONDITIONAL 3
#define sd_log_state_e_SD_LOG_WAIT_COND 7
#define sd_log_state_e_SD_LOG_WAIT_RPM 6
#define SDLoggerMode_auto_enum 0="None",4="Dtc",1="Mlg",2="ToothBin",3="ToothCsv"
#define SDLoggerMode_Dtc 4
#define SDLoggerMode_enum "Off", "Full MLG", "Trigger bin", "Trigger CSV", "DTC Freeze Frame"
#define SDLoggerMode_Mlg 1
#define SDLoggerMode_None 0
#define SDLoggerMode_ToothBin 2
#define SDLoggerMode_ToothCsv 3
#define SECOND_IGNITION_TABLE "Second Ignition Table"
#define SECOND_VE_TABLE "Second VE Table"
#define SECONDARY_CAN_NAME "Secondary CAN"
#define SECONDARY_PANELS_FILE "tunerstudio/secondary_panels.ini"
#define SelectedGear_Drive 6
#define SelectedGear_Invalid 0
#define SelectedGear_Low 11
#define SelectedGear_Manual 7
#define SelectedGear_Manual1 10
#define SelectedGear_Manual2 9
#define SelectedGear_Manual3 8
#define SelectedGear_ManualMinus 2
#define SelectedGear_ManualPlus 1
#define SelectedGear_Neutral 5
#define SelectedGear_Park 3
#define SelectedGear_Reverse 4
#define SENT_INPUT_COUNT 1
#define sent_input_pin_e_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define SentEtbType_auto_enum 0="NONE",3="CUSTOM",2="FORD_TYPE_1",1="GM_TYPE_1"
#define SentEtbType_CUSTOM 3
#define SentEtbType_enum "None", "GM type 1", "Ford type 1", "Custom"
#define SentEtbType_FORD_TYPE_1 2
#define SentEtbType_GM_TYPE_1 1
#define SentEtbType_NONE 0
#define SentFuelHighPressureType_auto_enum 0="NONE",1="GM_TYPE"
#define SentFuelHighPressureType_enum "None", "GM type", "Custom"
#define SentFuelHighPressureType_GM_TYPE 1
#define SentFuelHighPressureType_NONE 0
#define SentInput_auto_enum 0="NONE",1="INPUT1",2="INPUT2",3="INPUT3",4="INPUT4",5="INPUT5",6="INPUT6",7="INPUT7"
#define SentInput_enum "None", "SENT input 1", "SENT input 2", "SENT input 3", "SENT input 4", "SENT input 5", "SENT input 6", "SENT input 7"
#define SentInput_INPUT1 1
#define SentInput_INPUT2 2
#define SentInput_INPUT3 3
#define SentInput_INPUT4 4
#define SentInput_INPUT5 5
#define SentInput_INPUT6 6
#define SentInput_INPUT7 7
#define SentInput_NONE 0
#define show_tcu_gauges false
#define show_test_presets true
#define show_vvt_output_pin true
#define SIGNATURE_HASH 4020709435
#define SIMULATOR_TUNE_BIN_FILE_NAME "generated/simulator_tune_image.bin"
#define SIMULATOR_TUNE_BIN_FILE_NAME_PREFIX "generated/simulator_tune_image"
#define SIMULATOR_TUNE_BIN_FILE_NAME_SUFFIX ".bin"
#define smLaunchControl_NAME "Launch Control"
#define SMOOTHED_GAUGE_NAME_AFR "Smoothed Air/Fuel Ratio"
#define SMOOTHED_GAUGE_NAME_AFR2 "Smoothed Air/Fuel Ratio 2"
#define spi_device_e_auto_enum 0="SPI_NONE",1="SPI_DEVICE_1",2="SPI_DEVICE_2",3="SPI_DEVICE_3",4="SPI_DEVICE_4",5="SPI_DEVICE_5",6="SPI_DEVICE_6"
#define spi_device_e_SPI_DEVICE_1 1
#define spi_device_e_SPI_DEVICE_2 2
#define spi_device_e_SPI_DEVICE_3 3
#define spi_device_e_SPI_DEVICE_4 4
#define spi_device_e_SPI_DEVICE_5 5
#define spi_device_e_SPI_DEVICE_6 6
#define spi_device_e_SPI_NONE 0
#define stepper_num_micro_steps_e_auto_enum 0="STEPPER_FULL",8="STEPPER_EIGHTH",4="STEPPER_FOURTH",2="STEPPER_HALF"
#define stepper_num_micro_steps_e_enum "Full-Step (Default)", "INVALID", "Half-Step", "INVALID", "1/4 Micro-Step", "INVALID", "INVALID", "INVALID", "1/8 Micro-Step"
#define stepper_num_micro_steps_e_STEPPER_EIGHTH 8
#define stepper_num_micro_steps_e_STEPPER_FOURTH 4
#define stepper_num_micro_steps_e_STEPPER_FULL 0
#define stepper_num_micro_steps_e_STEPPER_HALF 2
#define stft_cell_cfg_s_size 4
#define STFT_CELL_COUNT 4
#define stft_s_size 28
#define stft_state_e_stftDisabledAfrOurOfRange 6
#define stft_state_e_stftDisabledClt 5
#define stft_state_e_stftDisabledCrankingDelay 4
#define stft_state_e_stftDisabledDFCO 7
#define stft_state_e_stftDisabledFuelCut 9
#define stft_state_e_stftDisabledLaunch 10
#define stft_state_e_stftDisabledRPM 3
#define stft_state_e_stftDisabledSettings 1
#define stft_state_e_stftDisabledTpsAccel 8
#define stft_state_e_stftDisabledTuning 2
#define stft_state_e_stftEnabled 0
#define switch_input_pin_e_enum 0="NONE",68="ACPRESS (PE2)",70="ACSW (PE4)",27="CAM (PB9)",25="CAM2 (PB7)",26="CKP (PB8)",23="CLUTCH (PB5)",61="D12 (PD11)",60="D13 (PD10)",33="D23 (SPI2 MOSI B15)",32="D25 (SPI2 MISO B14)",30="D27 (SPI2 CS B12)",31="D29 (SPI2 SCK B13)",17="FLEX (PA15)",81="IN22L (PE15)",53="IN42H (D3)",67="PSP (PE1)",56="RX3 (PD6)",55="TX3 (PD5)",24="VSS (PB6)"
#define switch_input_pin_e_fullenum "NONE","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","FLEX (PA15)","INVALID","INVALID","INVALID","INVALID","INVALID","CLUTCH (PB5)","VSS (PB6)","CAM2 (PB7)","CKP (PB8)","CAM (PB9)","INVALID","INVALID","D27 (SPI2 CS B12)","D29 (SPI2 SCK B13)","D25 (SPI2 MISO B14)","D23 (SPI2 MOSI B15)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","IN42H (D3)","INVALID","TX3 (PD5)","RX3 (PD6)","INVALID","INVALID","INVALID","D13 (PD10)","D12 (PD11)","INVALID","INVALID","INVALID","INVALID","INVALID","PSP (PE1)","ACPRESS (PE2)","INVALID","ACSW (PE4)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","IN22L (PE15)","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID","INVALID"
#define TABLE_2_LOAD_SIZE 8
#define TABLE_2_RPM_SIZE 8
#define TABLE_3_LOAD_SIZE 8
#define TABLE_3_RPM_SIZE 8
#define TABLE_4_LOAD_SIZE 8
#define TABLE_4_RPM_SIZE 10
#define TABLE_SCALE __TMPL_TABLE_SCALE__
#define TARGET_AFR_BLEND_COUNT 2
#define TARGET_AFR_BLEND_PRECISION 0.01
#define tChargeMode_e_auto_enum 0="TCHARGE_MODE_RPM_TPS",1="TCHARGE_MODE_AIR_INTERP",2="TCHARGE_MODE_AIR_INTERP_TABLE"
#define tChargeMode_e_enum "RPM+TPS (Default)", "Air Mass Interpolation", "Table"
#define tChargeMode_e_TCHARGE_MODE_AIR_INTERP 1
#define tChargeMode_e_TCHARGE_MODE_AIR_INTERP_TABLE 2
#define tChargeMode_e_TCHARGE_MODE_RPM_TPS 0
#define TCU_GEAR_COUNT 10
#define TCU_RANGE_COUNT 11
#define TCU_SOLENOID_COUNT 6
#define TCU_TABLE_WIDTH 8
#define TERTIARY_CAN_NAME "Third CAN"
#define thermistor_conf_s_size 28
#define ThermistorConf_size 32
#define THR_EST_SIZE 12
#define timing_mode_e_auto_enum 0="TM_DYNAMIC",1="TM_FIXED"
#define timing_mode_e_TM_DYNAMIC 0
#define timing_mode_e_TM_FIXED 1
#define tle8888_mode_e_auto_enum 0="TL_AUTO",3="TL_HALL",2="TL_MANUAL",1="TL_SEMI_AUTO"
#define tle8888_mode_e_TL_AUTO 0
#define tle8888_mode_e_TL_HALL 3
#define tle8888_mode_e_TL_MANUAL 2
#define tle8888_mode_e_TL_SEMI_AUTO 1
#define TMF_RATIO_SIZE 2
#define TMF_SIZE 2
#define TOOTH_DATA_LENGTH 2000
#define TOOTH_PACKET_COUNT 1000
#define TOOTH_PACKET_SIZE 2
#define TOP_DEAD_CENTER_MESSAGE "r"
#define TOP_LEVEL_MENU_FILE "tunerstudio/top_level_menu.ini"
#define TORQUE_CURVE_RPM_SIZE 6
#define TORQUE_CURVE_SIZE 6
#define TORQUE_TABLE_X_SIZE 6
#define TORQUE_TABLE_Y_SIZE 2
#define torqueReductionActivationMode_e_auto_enum 0="TORQUE_REDUCTION_BUTTON",1="LAUNCH_BUTTON",2="TORQUE_REDUCTION_CLUTCH_DOWN_SWITCH",3="TORQUE_REDUCTION_CLUTCH_UP_SWITCH"
#define torqueReductionActivationMode_e_enum "Torque Reduction Button", "Launch Button", "Clutch Down Switch", "Clutch Up Switch"
#define torqueReductionActivationMode_e_LAUNCH_BUTTON 1
#define torqueReductionActivationMode_e_TORQUE_REDUCTION_BUTTON 0
#define torqueReductionActivationMode_e_TORQUE_REDUCTION_CLUTCH_DOWN_SWITCH 2
#define torqueReductionActivationMode_e_TORQUE_REDUCTION_CLUTCH_UP_SWITCH 3
#define TOTAL_CONFIG_SIZE 16760
#define TPS_2_BYTE_PACKING_MULT 100
#define TPS_PPS_TOO_HIGH_THRESHOLD 110
#define TPS_PPS_TOO_LOW_THRESHOLD -10
#define TPS_TPS_ACCEL_CLT_CORR_TABLE 4
#define TPS_TPS_ACCEL_TABLE 8
#define TRACTION_CONTROL_ETB_DROP_SLIP_SIZE 6
#define TRACTION_CONTROL_ETB_DROP_SPEED_SIZE 6
#define TRAILING_SPARK_RPM_SIZE 4
#define TRAILING_SPARK_SIZE 4
#define transmission_controller_e_enum "None", "Simple Transmission", "Generic 4-Speed", "GM 4L6X"
#define TransmissionControllerMode_auto_enum 0="None",2="Generic4",3="Gm4l6x",1="SimpleTransmissionController"
#define TransmissionControllerMode_Generic4 2
#define TransmissionControllerMode_Gm4l6x 3
#define TransmissionControllerMode_None 0
#define TransmissionControllerMode_SimpleTransmissionController 1
#define TRIGGER_COMMENT "#"
#define trigger_config_s_size 12
#define TRIGGER_CRANK_BASED trigger_type == 2 || trigger_type == 5 || trigger_type == 10 || trigger_type == 12 || trigger_type == 20 || trigger_type == 21 || trigger_type == 26 || trigger_type == 27 || trigger_type == 32 || trigger_type == 33 || trigger_type == 38 || trigger_type == 44 || trigger_type == 45 || trigger_type == 46 || trigger_type == 53 || trigger_type == 55 || trigger_type == 57 || trigger_type == 58 || trigger_type == 61 || trigger_type == 62 || trigger_type == 68 || trigger_type == 70 || trigger_type == 71 || trigger_type == 72 || trigger_type == 74 || trigger_type == 75 || trigger_type == 76 || trigger_type == 77 || trigger_type == 84 || trigger_type == 87 || trigger_type == 92 || trigger_type == 93 || trigger_type == 94 || trigger_type == 96
#define TRIGGER_CYCLE_DURATION "cycleDuration"
#define TRIGGER_GAP_FROM "gapFrom"
#define TRIGGER_GAP_TO "gapTo"
#define TRIGGER_GAPS_COUNT "gapsCount"
#define TRIGGER_HAS_SECOND_CHANNEL "hasSecondChannel"
#define TRIGGER_INPUT_PIN_COUNT 2
#define TRIGGER_IS_CRANK_KEY "crankBased"
#define TRIGGER_IS_SECOND_WHEEL_CAM "isSecondWheelCam"
#define TRIGGER_KNOWN_OPERATION_MODE "knownOperationMode"
#define TRIGGER_MODE "operationMode"
#define TRIGGER_ONLY_PRIMARY "useOnlyPrimaryForSync"
#define TRIGGER_SIMULATOR_PIN_COUNT 2
#define TRIGGER_SYNC_EDGE "syncEdge"
#define trigger_type_e_auto_enum 0="TT_TOOTHED_WHEEL",38="TT_12_TOOTH_CRANK",25="TT_2JZ_3_34_SIMULATION_ONLY",70="TT_36_2_1",71="TT_36_2_1_1",23="TT_36_2_2_2",31="TT_3_1_CAM",72="TT_3_TOOTH_CRANK",77="TT_60DEG_TOOTH",75="TT_60_2_2_F3R",20="TT_60_2_WRONG_POLARITY",80="TT_6_TOOTH_CRANK",85="TT_ARCTIC_CAT",21="TT_BENELLI_TRE",98="TT_BMW_VANOS_RELUCTOR",30="TT_CHRYSLER_NGC_36_2_2",90="TT_CHRYSLER_PHASER",88="TT_CUSTOM_1",89="TT_CUSTOM_2",6="TT_DAIHATSU_3_CYL",81="TT_DAIHATSU_4_CYL",83="TT_DEV",2="TT_DODGE_NEON_1995",14="TT_DODGE_NEON_2003_CAM",32="TT_DODGE_NEON_2003_CRANK",19="TT_DODGE_RAM",22="TT_DODGE_STRATUS",41="TT_FIAT_IAW_P8",1="TT_FORD_ASPIRE",42="TT_FORD_ST170",39="TT_FORD_TFI_PIP_6",65="TT_FORD_TFI_PIP_8",74="TT_GM_24x_3",27="TT_GM_24x_5",54="TT_GM_60_2_2_2",5="TT_GM_7X",18="TT_HALF_MOON",28="TT_HONDA_CBR_600",87="TT_HONDA_J30A2_24_1_1",67="TT_HONDA_K_CAM_4_1",46="TT_HONDA_K_CRANK_12_1",93="TT_JEEPRENIX_66_2_2_2",37="TT_JEEP_18_2_2_2",40="TT_JEEP_4_CYL",92="TT_JEEP_EVD_36_2_2",57="TT_KAWA_KX450F",15="TT_MAZDA_DOHC_1_4",3="TT_MAZDA_MIATA_NA",35="TT_MAZDA_MIATA_VVT_TEST",7="TT_MAZDA_SOHC_4",10="TT_MERCEDES_2_SEGMENT",33="TT_MIATA_VVT",34="TT_MITSU_4G63_CAM",76="TT_MITSU_4G63_CRANK",11="TT_NARROW_SINGLE_TOOTH",84="TT_NISSAN_HR",86="TT_NISSAN_HR_CAM_IN",29="TT_NISSAN_K11",52="TT_NISSAN_MR18_CAM_VVT",68="TT_NISSAN_MR18_CRANK",61="TT_NISSAN_QR25",24="TT_NISSAN_SR20VE",60="TT_NISSAN_VQ30",58="TT_NISSAN_VQ35",16="TT_ONE_PLUS_ONE",44="TT_RENIX_44_2_2",45="TT_RENIX_66_2_2_2",26="TT_ROVER_K",55="TT_SKODA_FAVORIT",36="TT_SUBARU_7_6",94="TT_SUBARU_7_6_CRANK",12="TT_SUBARU_EZ30",49="TT_SUBARU_SVX",64="TT_SUBARU_SVX_CAM_VVT",63="TT_SUBARU_SVX_CRANK_1",66="TT_SUZUKI_G13B",95="TT_SUZUKI_G16B",50="TT_SUZUKI_K6A",69="TT_TOOTHED_WHEEL_32_2",9="TT_TOOTHED_WHEEL_36_1",48="TT_TOOTHED_WHEEL_36_2",8="TT_TOOTHED_WHEEL_60_2",91="TT_TOYOTA_3_TOOTH_UZ",53="TT_TRI_TACH",99="TT_UNUSED",96="TT_VIPER_V10_CRANK",56="TT_VVT_BARRA_3_PLUS_1",47="TT_VVT_BOSCH_QUICK_START",4="TT_VVT_FORD_COYOTE",82="TT_VVT_MAZDA_L",13="TT_VVT_MAZDA_SKYACTIV",43="TT_VVT_MIATA_NB",62="TT_VVT_MITSUBISHI_3A92",78="TT_VVT_MITSUBISHI_4G69",97="TT_VVT_MITSUBISHI_6G75",79="TT_VVT_MITSU_6G72",59="TT_VVT_NISSAN_VQ35",51="TT_VVT_SUBARU_7_WITHOUT_6",17="TT_VVT_TOYOTA_3_TOOTH",73="TT_VVT_TOYOTA_4_1"
