Antonecu/fw-custom-example/generated/controllers/generated/rusefi_generated_mega_stm32f4xx.h
#define trigger_type_e_enum "custom toothed wheel", "Ford Aspire", "Dodge Neon 1995", "Miata NA", "INVALID", "GM_7X", "Daihatsu 3 cylinder", "Mazda SOHC 4", "60-2", "36-1", "Mercedes Two Segment", "Single Tooth", "EZ30", "INVALID", "Dodge Neon 2003 Cam", "Mazda DOHC 1+4", "1+1", "INVALID", "Half Moon", "Dodge Ram 1+16", "60-2 Wrong Polarity", "Benelli Tre", "Dodge Stratus", "36_2_2_2", "Nissan Primera", "INVALID", "Rover K", "GM 24x 5 degree", "Honda CBR 600 Cam", "Nissan K11", "probably broken ChryslerNGC 36-2-2", "3-1 skipped", "Dodge Neon 2003 crank", "Miata NB", "INVALID", "INVALID", "Subaru 7+6", "Jeep 18-2-2-2", "12crank/24cam", "Ford PIP6", "Jeep XJ 4 cyl", "FiatIAQ_P8", "Mazda Z5", "INVALID", "Renix 44-2-2", "Renix 66-2-2-2", "Honda K 12+1", "INVALID", "36-2", "Subaru SVX", "Suzuki K6A", "Subaru 7 without 6", "INVALID", "INVALID", "GM 60-2-2-2", "Skoda Favorit", "INVALID", "Kawa KX450F", "Nissan VQ35", "INVALID", "Nissan VQ30", "Nissan QR25", "INVALID", "Subaru SVX Crank 1", "Subaru SVX Cam VVT", "Ford PIP8", "Suzuki G13B", "Honda K 4+1", "Nissan MR18 Crank", "32-2", "36-2-1", "36-2-1-1", "3-0", "INVALID", "GM 24x 3 degree", "60-2-2 F3R", "Mitsu 4G63 Crank", "x2 30 Deg camshaft BTDC", "INVALID", "INVALID", "6-0", "Daihatsu 4 cylinder", "INVALID", "dev", "Nissan HR", "Arctic Cat", "HR12 in", "HONDA J30A2", "trg88", "trg89", "Dodge/Chrysler/Jeep V8 5.7L", "Toyota UZ 3 tooth", "Jeep EVD 36-2-2", "Jeep 66-2-2-2", "Subaru 6 tooth Crank", "Suzuki G16B", "Viper", "INVALID", "INVALID"
#define trigger_type_e_TT_12_TOOTH_CRANK 38
#define trigger_type_e_TT_2JZ_3_34_SIMULATION_ONLY 25
#define trigger_type_e_TT_36_2_1 70
#define trigger_type_e_TT_36_2_1_1 71
#define trigger_type_e_TT_36_2_2_2 23
#define trigger_type_e_TT_3_1_CAM 31
#define trigger_type_e_TT_3_TOOTH_CRANK 72
#define trigger_type_e_TT_60_2_2_F3R 75
#define trigger_type_e_TT_60_2_WRONG_POLARITY 20
#define trigger_type_e_TT_60DEG_TOOTH 77
#define trigger_type_e_TT_6_TOOTH_CRANK 80
#define trigger_type_e_TT_ARCTIC_CAT 85
#define trigger_type_e_TT_BENELLI_TRE 21
#define trigger_type_e_TT_BMW_VANOS_RELUCTOR 98
#define trigger_type_e_TT_CHRYSLER_NGC_36_2_2 30
#define trigger_type_e_TT_CHRYSLER_PHASER 90
#define trigger_type_e_TT_CUSTOM_1 88
#define trigger_type_e_TT_CUSTOM_2 89
#define trigger_type_e_TT_DAIHATSU_3_CYL 6
#define trigger_type_e_TT_DAIHATSU_4_CYL 81
#define trigger_type_e_TT_DEV 83
#define trigger_type_e_TT_DODGE_NEON_1995 2
#define trigger_type_e_TT_DODGE_NEON_2003_CAM 14
#define trigger_type_e_TT_DODGE_NEON_2003_CRANK 32
#define trigger_type_e_TT_DODGE_RAM 19
#define trigger_type_e_TT_DODGE_STRATUS 22
#define trigger_type_e_TT_FIAT_IAW_P8 41
#define trigger_type_e_TT_FORD_ASPIRE 1
#define trigger_type_e_TT_FORD_ST170 42
#define trigger_type_e_TT_FORD_TFI_PIP_6 39
#define trigger_type_e_TT_FORD_TFI_PIP_8 65
#define trigger_type_e_TT_GM_24x_3 74
#define trigger_type_e_TT_GM_24x_5 27
#define trigger_type_e_TT_GM_60_2_2_2 54
#define trigger_type_e_TT_GM_7X 5
#define trigger_type_e_TT_HALF_MOON 18
#define trigger_type_e_TT_HONDA_CBR_600 28
#define trigger_type_e_TT_HONDA_J30A2_24_1_1 87
#define trigger_type_e_TT_HONDA_K_CAM_4_1 67
#define trigger_type_e_TT_HONDA_K_CRANK_12_1 46
#define trigger_type_e_TT_JEEP_18_2_2_2 37
#define trigger_type_e_TT_JEEP_4_CYL 40
#define trigger_type_e_TT_JEEP_EVD_36_2_2 92
#define trigger_type_e_TT_JEEPRENIX_66_2_2_2 93
#define trigger_type_e_TT_KAWA_KX450F 57
#define trigger_type_e_TT_MAZDA_DOHC_1_4 15
#define trigger_type_e_TT_MAZDA_MIATA_NA 3
#define trigger_type_e_TT_MAZDA_MIATA_VVT_TEST 35
#define trigger_type_e_TT_MAZDA_SOHC_4 7
#define trigger_type_e_TT_MERCEDES_2_SEGMENT 10
#define trigger_type_e_TT_MIATA_VVT 33
#define trigger_type_e_TT_MITSU_4G63_CAM 34
#define trigger_type_e_TT_MITSU_4G63_CRANK 76
#define trigger_type_e_TT_NARROW_SINGLE_TOOTH 11
#define trigger_type_e_TT_NISSAN_HR 84
#define trigger_type_e_TT_NISSAN_HR_CAM_IN 86
#define trigger_type_e_TT_NISSAN_K11 29
#define trigger_type_e_TT_NISSAN_MR18_CAM_VVT 52
#define trigger_type_e_TT_NISSAN_MR18_CRANK 68
#define trigger_type_e_TT_NISSAN_QR25 61
#define trigger_type_e_TT_NISSAN_SR20VE 24
#define trigger_type_e_TT_NISSAN_VQ30 60
#define trigger_type_e_TT_NISSAN_VQ35 58
#define trigger_type_e_TT_ONE_PLUS_ONE 16
#define trigger_type_e_TT_RENIX_44_2_2 44
#define trigger_type_e_TT_RENIX_66_2_2_2 45
#define trigger_type_e_TT_ROVER_K 26
#define trigger_type_e_TT_SKODA_FAVORIT 55
#define trigger_type_e_TT_SUBARU_7_6 36
#define trigger_type_e_TT_SUBARU_7_6_CRANK 94
#define trigger_type_e_TT_SUBARU_EZ30 12
#define trigger_type_e_TT_SUBARU_SVX 49
#define trigger_type_e_TT_SUBARU_SVX_CAM_VVT 64
#define trigger_type_e_TT_SUBARU_SVX_CRANK_1 63
#define trigger_type_e_TT_SUZUKI_G13B 66
#define trigger_type_e_TT_SUZUKI_G16B 95
#define trigger_type_e_TT_SUZUKI_K6A 50
#define trigger_type_e_TT_TOOTHED_WHEEL 0
#define trigger_type_e_TT_TOOTHED_WHEEL_32_2 69
#define trigger_type_e_TT_TOOTHED_WHEEL_36_1 9
#define trigger_type_e_TT_TOOTHED_WHEEL_36_2 48
#define trigger_type_e_TT_TOOTHED_WHEEL_60_2 8
#define trigger_type_e_TT_TOYOTA_3_TOOTH_UZ 91
#define trigger_type_e_TT_TRI_TACH 53
#define trigger_type_e_TT_UNUSED 99
#define trigger_type_e_TT_VIPER_V10_CRANK 96
#define trigger_type_e_TT_VVT_BARRA_3_PLUS_1 56
#define trigger_type_e_TT_VVT_BOSCH_QUICK_START 47
#define trigger_type_e_TT_VVT_FORD_COYOTE 4
#define trigger_type_e_TT_VVT_MAZDA_L 82
#define trigger_type_e_TT_VVT_MAZDA_SKYACTIV 13
#define trigger_type_e_TT_VVT_MIATA_NB 43
#define trigger_type_e_TT_VVT_MITSU_6G72 79
#define trigger_type_e_TT_VVT_MITSUBISHI_3A92 62
#define trigger_type_e_TT_VVT_MITSUBISHI_4G69 78
#define trigger_type_e_TT_VVT_MITSUBISHI_6G75 97
#define trigger_type_e_TT_VVT_NISSAN_VQ35 59
#define trigger_type_e_TT_VVT_SUBARU_7_WITHOUT_6 51
#define trigger_type_e_TT_VVT_TOYOTA_3_TOOTH 17
#define trigger_type_e_TT_VVT_TOYOTA_4_1 73
#define TRIGGER_TYPE_WITH_SECOND_WHEEL trigger_type == 1 || trigger_type == 3 || trigger_type == 15 || trigger_type == 16 || trigger_type == 19 || trigger_type == 25 || trigger_type == 31 || trigger_type == 35 || trigger_type == 36 || trigger_type == 37 || trigger_type == 40 || trigger_type == 49 || trigger_type == 54 || trigger_type == 63 || trigger_type == 64
#define TRIGGER_TYPE_WITHOUT_KNOWN_LOCATION trigger_type == 0 || trigger_type == 8 || trigger_type == 9 || trigger_type == 11 || trigger_type == 17 || trigger_type == 18 || trigger_type == 23 || trigger_type == 48 || trigger_type == 69 || trigger_type == 73 || trigger_type == 88 || trigger_type == 89
#define TRIGGER_WITH_SYNC "isSynchronizationNeeded"
#define TRIGGER_WITHOUT_TDC "shapeWithoutTdc"
#define TRIGGERS_FILE_NAME "triggers.txt"
#define TriggerWheel_T_PRIMARY 0
#define TriggerWheel_T_SECONDARY 1
#define TRUE_FALSE_COUNT_LIMIT 62
#define ts_14_command_COMMAND_X14_UNUSED_0 0x00
#define ts_14_command_COMMAND_X14_UNUSED_1 0x01
#define ts_14_command_COMMAND_X14_UNUSED_15 0x15
#define ts_14_command_COMMAND_X14_UNUSED_2 0x02
#define ts_14_command_TS_DTC_MANAGER_SHOT 0x26
#define ts_14_command_TS_ESTIMATE_TORQUE_TABLE 0x23
#define ts_14_command_TS_ETB_AUTOCAL_0 0x0E
#define ts_14_command_TS_ETB_AUTOCAL_0_FAST 0x1C
#define ts_14_command_TS_ETB_AUTOCAL_1 0x11
#define ts_14_command_TS_ETB_AUTOCAL_1_FAST 0x1D
#define ts_14_command_TS_ETB_BENCH_TEST_0 0x24
#define ts_14_command_TS_ETB_BENCH_TEST_1 0x25
#define ts_14_command_TS_ETB_DISABLE_JAM_DETECT 0x14
#define ts_14_command_TS_ETB_RESET 0x0B
#define ts_14_command_TS_ETB_START_AUTOTUNE 0x0C
#define ts_14_command_TS_ETB_STOP_AUTOTUNE 0x10
#define ts_14_command_TS_EWG_AUTOCAL_0 0x1E
#define ts_14_command_TS_EWG_AUTOCAL_0_FAST 0x1F
#define ts_14_command_TS_EXTERNAL_TRIGGER_STIMULATOR_ENABLE 0x13
#define ts_14_command_TS_GRAB_PEDAL_UP 6
#define ts_14_command_TS_GRAB_PEDAL_WOT 7
#define ts_14_command_TS_GRAB_TPS_CLOSED 0x20
#define ts_14_command_TS_GRAB_TPS_OPEN 0x21
#define ts_14_command_TS_RESET_MC33810 0x16
#define ts_14_command_TS_RESET_TLE8888 8
#define ts_14_command_TS_SD_DELETE_REPORTS 0x1B
#define ts_14_command_TS_SD_FORMAT 0x1A
#define ts_14_command_TS_SD_MOUNT_ECU 0x18
#define ts_14_command_TS_SD_MOUNT_PC 0x17
#define ts_14_command_TS_SD_UNMOUNT 0x19
#define ts_14_command_TS_SET_STEPPER_IDLE 0x05
#define ts_14_command_TS_START_STOP_ENGINE 0x09
#define ts_14_command_TS_TCU_DOWNSHIFT_REQUEST 0x04
#define ts_14_command_TS_TCU_UPSHIFT_REQUEST 0x03
#define ts_14_command_TS_TRIGGER_STIMULATOR_DISABLE 0x0F
#define ts_14_command_TS_TRIGGER_STIMULATOR_ENABLE 0x0D
#define ts_14_command_TS_WIDEBAND_UPDATE 0x12
#define ts_14_command_TS_WIDEBAND_UPDATE_FILE 0x22
#define ts_14_command_TS_WRITE_FLASH 0x0A
#define TS_BLOCK_READ_TIMEOUT 3000
#define TS_BOARD_COMMAND 'j'
#define TS_BOARD_COMMAND_char j
#define TS_BURN_COMMAND 'B'
#define TS_BURN_COMMAND_char B
#define TS_CHUNK_WRITE_COMMAND 'C'
#define TS_CHUNK_WRITE_COMMAND_char C
#define ts_cic_idle false
#define ts_command_e_TS_BENCH_CATEGORY 22
#define ts_command_e_TS_BOARD_ACTION 29
#define ts_command_e_TS_BOARD_ACTION2 26
#define ts_command_e_TS_BOARD_ACTION3 27
#define ts_command_e_TS_BOARD_ACTION4 28
#define ts_command_e_TS_CLEAR_WARNINGS 17
#define ts_command_e_TS_COMMAND_1 1
#define ts_command_e_TS_COMMAND_10 10
#define ts_command_e_TS_COMMAND_11 11
#define ts_command_e_TS_COMMAND_12 12
#define ts_command_e_TS_COMMAND_13 13
#define ts_command_e_TS_COMMAND_14 14
#define ts_command_e_TS_COMMAND_15 15
#define ts_command_e_TS_COMMAND_16 16
#define ts_command_e_TS_COMMAND_2 2
#define ts_command_e_TS_COMMAND_3 3
#define ts_command_e_TS_COMMAND_4 4
#define ts_command_e_TS_COMMAND_5 5
#define ts_command_e_TS_COMMAND_6 6
#define ts_command_e_TS_COMMAND_7 7
#define ts_command_e_TS_COMMAND_8 8
#define ts_command_e_TS_COMMAND_9 9
#define ts_command_e_TS_IGNITION_CATEGORY 18
#define ts_command_e_TS_INJECTOR_CATEGORY 19
#define ts_command_e_TS_LUA_OUTPUT_CATEGORY 32
#define ts_command_e_TS_SET_DEFAULT_ENGINE 31
#define ts_command_e_TS_SET_ENGINE_TYPE 30
#define ts_command_e_TS_SOLENOID_CATEGORY 25
#define ts_command_e_TS_STOP_ENGINE 36
#define ts_command_e_TS_UNUSED_0 0
#define ts_command_e_TS_UNUSED_23 23
#define ts_command_e_TS_UNUSED_24 24
#define ts_command_e_TS_WIDEBAND 21
#define ts_command_e_TS_WIDEBAND_FLASH_BY_ID 35
#define ts_command_e_TS_WIDEBAND_FLASH_BY_ID_FILE 38
#define ts_command_e_TS_WIDEBAND_PING_BY_ID 34
#define ts_command_e_TS_WIDEBAND_RESTART 39
#define ts_command_e_TS_WIDEBAND_SET_IDX_BY_ID 33
#define ts_command_e_TS_WIDEBAND_SET_SENS_BY_ID 37
#define ts_command_e_TS_X14 20
#define TS_COMMAND_F 'F'
#define TS_COMMAND_F_char F
#define TS_COMPOSITE_DISABLE 2
#define TS_COMPOSITE_ENABLE 1
#define TS_COMPOSITE_PRI_ENABLE 7
#define TS_COMPOSITE_READ 3
#define TS_CRC32_CHECK_COMMAND 'K'
#define TS_CRC32_CHECK_COMMAND_char K
#define TS_CRC_CHECK_COMMAND 'k'
#define TS_CRC_CHECK_COMMAND_char k
#define ts_ecu_locking true
#define TS_EXECUTE 'E'
#define TS_EXECUTE_char E
#define TS_GET_COMPOSITE_BUFFER_DONE_DIFFERENTLY '8'
#define TS_GET_COMPOSITE_BUFFER_DONE_DIFFERENTLY_char 8
#define TS_GET_CONFIG_ERROR 'e'
#define TS_GET_CONFIG_ERROR_char e
#define TS_GET_FIRMWARE_VERSION 'V'
#define TS_GET_FIRMWARE_VERSION_char V
#define TS_GET_OUTPUTS_SIZE '4'
#define TS_GET_OUTPUTS_SIZE_char 4
#define TS_GET_PROTOCOL_VERSION_COMMAND_F 'F'
#define TS_GET_PROTOCOL_VERSION_COMMAND_F_char F
#define TS_GET_SCATTERED_GET_COMMAND '9'
#define TS_GET_SCATTERED_GET_COMMAND_char 9
#define TS_GET_TEXT 'G'
#define TS_GET_TEXT_char G
#define TS_HELLO_COMMAND 'S'
#define TS_HELLO_COMMAND_char S
#define TS_IO_TEST_COMMAND 'Z'
#define TS_IO_TEST_COMMAND_char Z
#define TS_ONLINE_PROTOCOL 'z'
#define TS_ONLINE_PROTOCOL_char z
#define TS_OUTPUT_ALL_COMMAND 'A'
#define TS_OUTPUT_ALL_COMMAND_char A
#define TS_OUTPUT_COMMAND 'O'
#define TS_OUTPUT_COMMAND_char O
#define TS_PAGE_BURN_COMMANDS "B%2i", "", "", "B%2i", "B%2i"
#define TS_PAGE_CHUNK_WRITE "C%2i%2o%2c%v", "C%2i%2o%2c%v", "C%2i%2o%2c%v", "C%2i%2o%2c%v", "C%2i%2o%2c%v"
#define TS_PAGE_COUNT 5
#define TS_PAGE_CRC_CHECK "k%2i%2o%2c", "k%2i%2o%2c", "k%2i%2o%2c", "k%2i%2o%2c", "k%2i%2o%2c"
#define TS_PAGE_IDENTIFIERS "\x00\x00", "\x00\x01", "\x00\x02", "\x00\x03", "\x00\x04"
#define TS_PAGE_READ_COMMANDS "R%2i%2o%2c", "R%2i%2o%2c", "R%2i%2o%2c", "R%2i%2o%2c", "R%2i%2o%2c"
#define TS_PAGE_SIZES 16760, 256, 2048, 1268, 8000
#define TS_PAGE_VALUE_WRITE "C%2i%2o%2c%v", "C%2i%2o%2c%v", "C%2i%2o%2c%v", "C%2i%2o%2c%v", "C%2i%2o%2c%v"
#define TS_PERF_TRACE_BEGIN '_'
#define TS_PERF_TRACE_BEGIN_char _
#define TS_PERF_TRACE_GET_BUFFER 'b'
#define TS_PERF_TRACE_GET_BUFFER_char b
#define TS_PROTOCOL "001"
#define TS_QUERY_BOOTLOADER 'L'
#define TS_QUERY_BOOTLOADER_char L
#define TS_QUERY_BOOTLOADER_NONE 0
#define TS_QUERY_BOOTLOADER_OPENBLT 1
#define TS_QUERY_COMMAND 'Q'
#define TS_QUERY_COMMAND_char Q
#define TS_READ32_COMMAND '('
#define TS_READ32_COMMAND_char (
#define TS_READ_COMMAND 'R'
#define TS_READ_COMMAND_char R
#define TS_RESPONSE_BURN_OK 4
#define TS_RESPONSE_CRC_FAILURE 0x82
#define TS_RESPONSE_FRAMING_ERROR 0x8D
#define TS_RESPONSE_OK 0
#define TS_RESPONSE_OUT_OF_RANGE 0x84
#define TS_RESPONSE_OVERRUN 0x81
#define TS_RESPONSE_UNDERRUN 0x80
#define TS_RESPONSE_UNRECOGNIZED_COMMAND 0x83
#define TS_SCATTER_OFFSETS_COUNT 128
#define TS_SET_LOGGER_SWITCH 'l'
#define TS_SET_LOGGER_SWITCH_char l
#define ts_show_accelerometer false
#define ts_show_acr_pins true
#define ts_show_adv_wall_wetting true
#define ts_show_AdvanceCorrectionsForCranking true
#define ts_show_air_conditioning true
#define ts_show_alternator true
#define ts_show_analog_diag false
#define ts_show_analog_divider true
#define ts_show_analog_ego true
#define ts_show_analog_input_settings true
#define ts_show_analog_o2 true
#define ts_show_aux_connections true
#define ts_show_aux_sensors true
#define ts_show_auxserial_pins true
#define ts_show_bank2_cam1 true
#define ts_show_bank2_cam2 true
#define ts_show_baroSettings true
#define ts_show_basic_configurations false
#define ts_show_bench_test true
#define ts_show_brake_pedal_indicator true
#define ts_show_brake_pedal_pin true
#define ts_show_cam1 true
#define ts_show_cam2 true
#define ts_show_can2 false
#define ts_show_can_bitrate true
#define ts_show_can_pins false
#define ts_show_can_verbose true
#define ts_show_can_wbo true
#define ts_show_can_wbo_type true
#define ts_show_can_weird true
#define ts_show_canbus3 false
#define ts_show_canbus_sniffer false
#define ts_show_charge_estimation true
#define ts_show_check_engine false
#define ts_show_clt true
#define ts_show_clt_iat_pullup false
#define ts_show_clutch_down true
#define ts_show_clutch_down_pin true
#define ts_show_clutch_up true
#define ts_show_clutch_up_pin true
#define ts_show_communityCommsLedPin false
#define ts_show_complexWallModel true
#define ts_show_compression_ratio false
#define ts_show_compressor_sensor true
#define ts_show_console_settings true
#define ts_show_cranking_rpm true
#define ts_show_crankingTpsCurve true
#define ts_show_cylinder_10 true
#define ts_show_cylinder_11 true
#define ts_show_cylinder_12 true
#define ts_show_cylinder_2 true
#define ts_show_cylinder_3 true
#define ts_show_cylinder_4 true
#define ts_show_cylinder_5 true
#define ts_show_cylinder_6 true
#define ts_show_cylinder_7 true
#define ts_show_cylinder_8 true
#define ts_show_cylinder_9 true
#define ts_show_cylinder_bank true
#define ts_show_cylinder_trim_1 true
#define ts_show_cylinder_trim_2 true
#define ts_show_dc_hardware true
#define ts_show_debug_mode false
#define ts_show_disable_etb false
#define ts_show_ecu_stimulator true
#define ts_show_ego2 true
#define ts_show_egt true
#define ts_show_enableKnockSpectrogram true
#define ts_show_engine_code true
#define ts_show_engine_make true
#define ts_show_etb true
#define ts_show_etb_bias_curve true
#define ts_show_etb_extra_monitoring
#define ts_show_etb_frequency true
#define ts_show_etb_min_max true
#define ts_show_etb_pid true
#define ts_show_etb_pid_autotune true
#define ts_show_etb_pins false
#define ts_show_exhaust_vvt true
#define ts_show_experimental true
#define ts_show_fan2_settings true
#define ts_show_fan_settings true
#define ts_show_fancy_hardware false
#define ts_show_faster_spin_up true
#define ts_show_final_ratio true
#define ts_show_firing_order true
#define ts_show_flex_inverted true
#define ts_show_flood_clear true
#define ts_show_flow_units true
#define ts_show_forced_induction false
#define ts_show_ford_toyota_tps_pps true
#define ts_show_FractionDivisor true
#define ts_show_fuel_level_sensor true
#define ts_show_fuel_pressure_sensor true
#define ts_show_fuel_pump true
#define ts_show_fuel_relay_pin true
#define ts_show_fuel_strategy true
#define ts_show_fuel_temp_sensor true
#define ts_show_fuel_threshold true
#define ts_show_fuel_trim_cylinder_1 true
#define ts_show_fuel_trim_cylinder_10 true
#define ts_show_fuel_trim_cylinder_11 true
#define ts_show_fuel_trim_cylinder_12 true
#define ts_show_fuel_trim_cylinder_2 true
#define ts_show_fuel_trim_cylinder_3 true
#define ts_show_fuel_trim_cylinder_4 true
#define ts_show_fuel_trim_cylinder_5 true
#define ts_show_fuel_trim_cylinder_6 true
#define ts_show_fuel_trim_cylinder_7 true
#define ts_show_fuel_trim_cylinder_8 true
#define ts_show_fuel_trim_cylinder_9 true
#define ts_show_fuel_trims true
#define ts_show_full_pinout true
#define ts_show_gasoline_scale true
#define ts_show_gdi false
#define ts_show_gdi_low_level false
#define ts_show_globalTriggerAngleOffset true
#define ts_show_gppwm1_pin true
#define ts_show_gppwm2_pin true
#define ts_show_gppwm3_error_value true
#define ts_show_gppwm3_frequency true
#define ts_show_gppwm3_pin true
#define ts_show_gppwm4_pin true
#define ts_show_gppwm_1 true
#define ts_show_gppwm_2 true
#define ts_show_gppwm_3 true
#define ts_show_gppwm_4 true
#define ts_show_grab_tps true
#define ts_show_hardware_simulator false
#define ts_show_hbridge_function true
#define ts_show_hd true
#define ts_show_i2c false
#define ts_show_i2c1_enable true
#define ts_show_i2c1_pins true
#define ts_show_i2c2_enable true
#define ts_show_i2c2_pins true
#define ts_show_i2c3_enable true
#define ts_show_i2c3_pins true
#define ts_show_i2c4_enable true
#define ts_show_i2c4_pins false
#define ts_show_iat true
#define ts_show_idle_hardware true
#define ts_show_ign_key_analog_input false
#define ts_show_ign_key_menu true
#define ts_show_ign_key_switch false
#define ts_show_ignition true
#define ts_show_ignitionMode true
#define ts_show_ignitionOutputs true
#define ts_show_ignitionPinMode false
#define ts_show_inj_diag false
#define ts_show_injection true
#define ts_show_injection_hardware true
#define ts_show_injection_mode true
#define ts_show_injection_phase true
#define ts_show_injectionPinMode false
#define ts_show_InjectorFlowLinearizationTable false
#define ts_show_injTest true
#define ts_show_intake_cam_edge true
#define ts_show_intake_vvt_direction true
#define ts_show_jam_detection true
#define ts_show_k_line false
#define ts_show_knock_cylinder_mapping true
#define ts_show_l9779 false
#define ts_show_linear_thermistors true
#define ts_show_live_data true
#define ts_show_long_term_fuel_trim false
#define ts_show_ltft_sd_card_message true
#define ts_show_maf true
#define ts_show_main_relay true
#define ts_show_main_relay_microRusEFI_message false
#define ts_show_map_averaging_enabled true
#define ts_show_map_estimate true
#define ts_show_mapMinBufferLength true
#define ts_show_mc33810 false
#define ts_show_mc33810_cs false
#define ts_show_measureMapOnlyInOneCylinder true
#define ts_show_multispark true
#define ts_show_number_of_cylinders true
#define ts_show_odd_fire true
#define ts_show_oil_pressure_sensor true
#define ts_show_oil_sensors true
#define ts_show_oil_temp_sensor true
#define ts_show_onboard_accelerometer false
#define ts_show_output_diag false
#define ts_show_popular_vehicles true
#define ts_show_primary_trigger true
#define ts_show_reboot_to_dfu true
#define ts_show_reset_calibrations true
#define ts_show_rotary true
#define ts_show_sd_card true
#define ts_show_sd_pins true
#define ts_show_second_bank true
#define ts_show_sent false
#define ts_show_software_knock true
#define ts_show_sparkHardwareLatencyCorrection true
#define ts_show_speedo_settings true
#define ts_show_speedSensorCan true
#define ts_show_spi true
#define ts_show_spi1_enable true
#define ts_show_spi1_pins true
#define ts_show_spi2_enable true
#define ts_show_spi2_pins true
#define ts_show_spi3_enable true
#define ts_show_spi3_pins true
#define ts_show_spi4_enable true
#define ts_show_spi4_pins false
#define ts_show_spi5_enable true
#define ts_show_spi5_pins false
#define ts_show_spi6_enable true
#define ts_show_spi6_pins false
#define ts_show_staged_injection true
#define ts_show_start_button true
#define ts_show_starter_disable true
#define ts_show_startup_map_baro_grab true
#define ts_show_status_leds false
#define ts_show_stepper_hbridge true
#define ts_show_stepper_push_pull false
#define ts_show_strokes true
#define ts_show_sync_cam true
#define ts_show_tachometer true
#define ts_show_tcu false
#define ts_show_throttle_switch true
#define ts_show_tle8888 false
#define ts_show_top_level_can_menu true
#define ts_show_torque_model true
#define ts_show_tps2 true
#define ts_show_tps_sent false
#define ts_show_traction_control true
#define ts_show_trigger_advanced true
#define ts_show_trigger_console true
#define ts_show_trigger_gap_override_flag true
#define ts_show_trigger_overrides true
#define ts_show_trigger_pins true
#define ts_show_tsp_pps_limits true
#define ts_show_tunerstudio_port true
#define ts_show_turbo_sensors true
#define ts_show_twoWireBatchIgnition true
#define ts_show_update_wbo_2023_to_2026 true
#define ts_show_useNoiselessTriggerDecoder true
#define ts_show_useRunningMathForCranking true
#define ts_show_useSeparateVeForIdle true
#define ts_show_vbatt true
#define ts_show_ve_blend true
#define ts_show_ve_table_map true
#define ts_show_veBlends2 true
#define ts_show_veBlends3 true
#define ts_show_veBlends4 true
#define ts_show_vehicle_name true
#define ts_show_vehicle_speed_sensor true
#define ts_show_virtual_dyno false
#define ts_show_vr_threshold_2 false
#define ts_show_vr_threshold_all false
#define ts_show_vr_threshold_pins true
#define ts_show_vvl_control true
#define ts_show_vvt_output true
#define ts_show_vvt_output_pin true
#define ts_show_wall_wetting true
#define ts_show_wastegate_sensor true
#define ts_show_wbo_can_menu true
#define ts_show_wbo_canbus_index true
#define ts_show_wbo_canbus_set_index true
#define ts_show_wbo_canbus_set_type false
#define TS_SIGNATURE "rusEFI main.2026.09.07.mega_stm32f4xx.4020709435"
#define TS_SIMULATE_CAN '>'
#define TS_SIMULATE_CAN_char >
#define TS_TEST_COMMAND 't'
#define TS_TEST_COMMAND_char t
#define TS_TOTAL_OUTPUT_SIZE 2200
#define TS_TRIGGER_SCOPE_CHANNEL_1_NAME "Channel 1"
#define TS_TRIGGER_SCOPE_CHANNEL_2_NAME "Channel 2"
#define TS_TRIGGER_SCOPE_DISABLE 5
#define TS_TRIGGER_SCOPE_ENABLE 4
#define TS_TRIGGER_SCOPE_READ 6
#define TsCalMode_EtbKd 5
#define TsCalMode_EtbKi 4
#define TsCalMode_EtbKp 3
#define TsCalMode_EwgPosMax 14
#define TsCalMode_EwgPosMin 15
#define TsCalMode_None 0
#define TsCalMode_PedalMax 13
#define TsCalMode_PedalMin 12
#define TsCalMode_Tps1Max 1
#define TsCalMode_Tps1Min 2
#define TsCalMode_Tps1SecondaryMax 6
#define TsCalMode_Tps1SecondaryMin 7
#define TsCalMode_Tps2Max 8
#define TsCalMode_Tps2Min 9
#define TsCalMode_Tps2SecondaryMax 10
#define TsCalMode_Tps2SecondaryMin 11
#define TUNING_SECTION_FILE "tunerstudio/tuning.ini"
#define uart_device_e_auto_enum 0="UART_NONE",1="UART_DEVICE_1",2="UART_DEVICE_2",3="UART_DEVICE_3",4="UART_DEVICE_4"
#define uart_device_e_UART_DEVICE_1 1
#define uart_device_e_UART_DEVICE_2 2
#define uart_device_e_UART_DEVICE_3 3
#define uart_device_e_UART_DEVICE_4 4
#define uart_device_e_UART_NONE 0
#define UiMode_auto_enum 0="FULL",1="INSTALLATION",2="TUNING"
#define UiMode_enum "Full", "INVALID", "Tuning"
#define UiMode_FULL 0
#define UiMode_INSTALLATION 1
#define UiMode_TUNING 2
#define UNITS_CELSIUS "C"
#define UNITS_FAHRENHEIT "F"
